[
    {
        "id": "integridad",
        "title": "Integridad (IDU)",
        "description": "Valores éticos institucionales definidos en la Cartilla de Integridad Gente IDU.",
        "subtopics": [
            {

"id": "integridad-compromiso",
    "title": "Compromiso",
    "content": "<p>El <strong>Compromiso</strong> en el Instituto de Desarrollo Urbano (IDU) trasciende la mera obligación laboral; es un valor ético central que guía la conducta de sus servidores públicos, transformando la integridad en acciones concretas y proactivas en el día a día. Se entiende como la base fundamental para la consecución de los objetivos del IDU en beneficio directo de la ciudadanía bogotana.</p><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">I. ¿Qué es el Compromiso en el Contexto del IDU?</h4><p>La <strong>Definición oficial</strong> según la Cartilla de Integridad Gente IDU (Versión 6.0, 2024):</p><blockquote class=\"bg-gray-100 border-l-4 border-blue-500 text-gray-700 p-3 italic my-4\">\"Somos conscientes de la importancia del rol del servidor público y estamos en disposición permanente para comprender y resolver las necesidades de las personas con las que nos relacionamos en las labores cotidianas, buscando siempre mejorar su bienestar.\"</blockquote><p>Esta definición subraya aspectos clave:</p><ul class=\"list-disc ml-5\"><li><strong>Conciencia del Rol:</strong> Reconocer la trascendencia de la labor pública y el impacto en la sociedad.</li><li><strong>Disposición Permanente:</strong> Una actitud proactiva y constante para actuar.</li><li><strong>Orientación a las Necesidades Humanas:</strong> Enfocarse en comprender y resolver las necesidades de las personas (ciudadanos y compañeros).</li><li><strong>Búsqueda del Bienestar:</strong> El fin último del compromiso es mejorar el bienestar de quienes interactúan con el IDU.</li></ul><p class=\"text-sm text-gray-600 mt-2\"><em>Definición inicial (Versión 03, 2015):</em> \"Dar lo mejor personal y profesionalmente para alcanzar los objetivos y metas de la entidad.\" Si bien esta definición es más concisa y orientada a los resultados internos, la versión 6.0 la complementa y amplía, poniendo un énfasis explícito en el ciudadano y el impacto social. Para la prueba, la versión 6.0 es la más relevante.</p><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">II. Fundamentos Normativos y su Alcance</h4><p>El Compromiso no es un valor aislado, sino que está profundamente anclado en el marco normativo y ético del servicio público colombiano y distrital.</p><ul class=\"list-disc ml-5\"><li><strong>Código de Integridad Gente IDU:</strong> Este documento lo incluye como uno de los siete valores institucionales centrales del IDU (Honestidad, Respeto, Justicia, Diligencia, Compromiso, Innovación y Trabajo en Red). La Cartilla (versión 6.0) reemplaza la antigua 'cartilla Acuerdo Ético Gente IDU' y articula los valores organizacionales del IDU con los del Código de Integridad del Servicio Público nacional.</li><li><strong>Código de Integridad: Valores del Servicio Público (Nacional):</strong> Lanzado a mediados de 2017 por el Gobierno Nacional (DAFP), este código identifica el compromiso como uno de los cinco valores esenciales (honestidad, respeto, justicia, diligencia y compromiso). Es un documento de tipo general para todos los servidores públicos del país.</li><li><strong>Resolución 744 de 2024 (IDU):</strong> Esta resolución interna del IDU promueve específicamente que los servidores públicos incrementen su compromiso mediante la aplicación de principios y valores éticos, reforzando la voluntad institucional de fomentar este valor.</li><li><strong>Articulación Normativa Superior:</strong> El Código de Integridad (y por ende el compromiso) se encuentra articulado con la Constitución Política, el Modelo Integrado de Planeación y Gestión (MIPG), el Código Disciplinario Único, el Estatuto Anticorrupción, y la Ley 2195 de 2022 (\"Por medio de la cual se adoptan medidas en materia de transparencia, prevención y lucha contra la corrupción\"). Esto significa que el compromiso es un principio rector para la legalidad, la disciplina y la lucha contra la corrupción en el servicio público.</li><li><strong>Enfoque Preventivo:</strong> La intención del Gobierno Nacional y del IDU es incentivar conductas positivas a favor de la legalidad, la vocación de servicio y el privilegio del bien general antes que el bien particular, consolidando un enfoque preventivo en torno a la integridad pública. El compromiso es la manifestación de esta priorización del interés público.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">III. Comportamientos Clave Asociados al Compromiso (Lo que Hacemos y No Hacemos)</h4><p>La prueba de Integridad se centra en la aplicación práctica. Es fundamental internalizar qué significa actuar con compromiso y qué acciones lo contradicen.</p><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">A. Comportamientos Deseables (Lo que hacemos):</h5><ul class=\"list-disc ml-5\"><li><strong>Responsabilidad y Asunción del Rol:</strong> Asumir nuestro papel como servidoras y servidores públicos, entendiendo el valor de los compromisos y responsabilidades que hemos asumido frente a la ciudadanía y el país.</li><li><strong>Calidad y Agilidad en el Servicio:</strong> Prestar nuestro servicio de manera ágil, amable y con calidad.</li><li><strong>Colaboración y Apoyo Institucional:</strong> Estar atentos y atentas a colaborar con el cumplimiento de las metas institucionales. Esto implica hacer que las cosas trasciendan el campo individual, trabajando como equipo y como Instituto.</li><li><strong>Orientación al Ciudadano y Escucha Activa:</strong> Escuchar, atender y orientar a quien lo necesite. Generar una gran experiencia de servicio a los ciudadanos.</li><li><strong>Proactividad y Mentalidad Positiva:</strong> Decir: \"¡Sí se puede!\", trabajando en búsqueda de una mejora continua para llegar a los resultados. Esto implica asumir responsabilidades adicionales.</li><li><strong>Pensamiento en el Bien Común:</strong> Generar un contexto pensando en el bien común (Relaciones Gana-Gana).</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">B. Comportamientos No Deseables (Lo que no hacemos):</h5><ul class=\"list-disc ml-5 text-red-700\"><li><strong>Incoherencia:</strong> Ser Incoherente entre lo que decimos y lo que hacemos. No somos ejemplo.</li><li><strong>Incumplimiento:</strong> Incumplir nuestra palabra.</li><li><strong>Evasión de Responsabilidad:</strong> Buscar justificaciones para no cumplir.</li><li><strong>Mal Hablar Institucional:</strong> Hablar mal del IDU, sus líderes y sus servidores y servidoras.</li><li><strong>Desinterés/Negligencia:</strong> Ignorar las inquietudes de la ciudadanía o compañeros. Actuar con desinterés o negligencia.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">IV. Relación del Compromiso con Otros Valores y Subsistemas del IDU</h4><p>El compromiso se interrelaciona y potencia con otros valores y subsistemas de gestión, formando el \"ADN IDU\":</p><ul class=\"list-disc ml-5\"><li><strong>Diligencia:</strong> El compromiso se vincula con cumplir las tareas con prontitud, destreza y eficiencia. Un servidor comprometido es diligente al cumplir sus obligaciones a cabalidad, usando responsablemente los recursos públicos y no postergando decisiones.</li><li><strong>Honestidad:</strong> Actuar con compromiso implica transparencia en todas las acciones. Un servidor honesto dirá la verdad, aceptará su responsabilidad y cuidará los recursos públicos, lo cual es una manifestación de compromiso.</li><li><strong>Respeto:</strong> El compromiso se refleja en un trato amable, igualitario y equitativo con todas las personas, sin discriminación. Implica estar abierto al diálogo y a la comprensión.</li><li><strong>Innovación:</strong> El compromiso impulsa la búsqueda de nuevas formas de enfrentar retos, incorporar tecnologías y mejorar procesos. Un servidor comprometido está abierto a aprender y desaprender continuamente, multiplicando nuevos conocimientos.</li><li><strong>Trabajo en Red:</strong> El compromiso se traduce en desarrollar el trabajo de manera conectada y articulada, tejiendo relaciones y compartiendo logros, ideas e inquietudes. Implica asumir el rol consciente y responsable como parte de un equipo.</li><li><strong>Subsistema de Gestión Antisoborno (SGAS):</strong> El SGAS prohíbe el soborno y se apalanca en la apropiación de los valores de integridad, incluido el compromiso, para la lucha contra la corrupción. Un servidor comprometido activamente contribuye a la prevención del soborno.</li><li><strong>Modelo y Subsistema de Gestión Empresa Familiarmente Responsable (efr):</strong> Este modelo se basa en la flexibilidad, el respeto y el compromiso mutuo (entidad - servidor/a) para conciliar la vida familiar, laboral y personal. El compromiso del servidor con la entidad se extiende a la corresponsabilidad por su bienestar.</li><li><strong>Programa CALDAS (Construcción de Ambientes Laborales Diversos, Amorosos y Seguros):</strong> CALDAS busca espacios libres de discriminación y respetuosos de la diferencia. El compromiso se alinea con CALDAS al fomentar un ambiente donde la diversidad es una oportunidad de crecimiento.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">V. Interiorización del Valor Compromiso y Preparación para la Prueba CNSC</h4><p>El compromiso no es solo una cualidad individual, sino una práctica que se integra en el día a día del servidor público del IDU. Para la prueba, no solo es saber la definición, sino cómo aplicarla en situaciones reales.</p><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">A. Estrategias de Interiorización y Estudio:</h5><ul class=\"list-disc ml-5\"><li><strong>Lectura Activa:</strong> Leer y resumir detalladamente la sección de \"Compromiso\" en las versiones 03 y 6.0 de la Cartilla/Código de Integridad Gente IDU. Identificar las diferencias y énfasis de cada versión.</li><li><strong>Análisis Conceptual:</strong> Reflexionar sobre la definición de compromiso: ¿Cómo se manifiesta la 'conciencia del rol público' en tu trabajo? ¿Cómo 'resuelves las necesidades de las personas' en tu labor diaria?</li><li><strong>Ejemplificación Personal:</strong> Piensa en 5 ejemplos reales (de tu entorno laboral/académico) donde hayas demostrado compromiso según las conductas deseables. Esto ayuda a personalizar el concepto y facilita la respuesta a preguntas situacionales.</li><li><strong>Comparación y Distinción:</strong> Comparar el compromiso con otros valores como honestidad (base de la verdad y justicia), diligencia (cumplimiento eficiente), y respeto (trato digno). Entender sus límites y puntos de intersección.</li><li><strong>Reflexión sobre Dilemas:</strong> ¿Cómo actuarías si un supervisor te encarga una tarea sensible sin acompañamiento y te sientes con dudas? ¿Priorizarías cumplir a medias o buscarías orientación y soluciones proactivas? Este tipo de reflexión es clave para las preguntas de juicio.</li><li><strong>Aplicación a Casos de TIC (Tu Rol):</strong> Relaciona el compromiso con ejemplos específicos de tu manual de funciones, como la 'ejecución del Plan Estratégico de Tecnologías de la Información y las Comunicaciones (PETIC)' o la 'Implementación de desarrollos de alta calidad de software'. Un compromiso en TI implicaría asegurar la ciberseguridad, cumplir cronogramas de desarrollo o garantizar la calidad del código, siempre pensando en el beneficio ciudadano.</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">B. Consejos para la Prueba CNSC (Preguntas de Integridad):</h5><ul class=\"list-disc ml-5\"><li><strong>Enfoque en el Interés General:</strong> Las respuestas correctas siempre priorizarán el bien común, la legalidad y la ética por encima de los intereses personales o grupales. Siempre elige la opción que beneficie más a la ciudadanía y a la institución.</li><li><strong>Coherencia y Transparencia:</strong> La CNSC valora la consistencia entre el pensamiento, la palabra y la acción. Evita cualquier opción que implique ocultar información, mentir, buscar justificaciones para el incumplimiento o actuar de forma ambigua.</li><li><strong>Proactividad y Resolución de Problemas:</strong> El compromiso se manifiesta en la iniciativa para proponer mejoras, comunicar problemas a tiempo y buscar soluciones, no en la pasividad, la espera de órdenes o la queja.</li><li><strong>Responsabilidad y Asunción de Errores:</strong> Un servidor comprometido acepta las consecuencias de sus actos y busca el aprendizaje colectivo a partir de ellos, sin culpar a terceros.</li><li><strong>Colaboración y Trabajo en Equipo:</strong> El compromiso trasciende lo individual; se valora el trabajo colaborativo, la construcción de redes y la apropiación de procesos como responsabilidad compartida.</li><li><strong>Lenguaje Formal y Profesional:</strong> Al analizar las opciones, elige aquellas que demuestren un lenguaje y un comportamiento alineado con los valores institucionales y el rol del servidor público. Busca frases como \"garantizar el interés general\", \"cumplir metas con responsabilidad\", \"optimizar el uso de recursos públicos\".</li><li><strong>Evitar Contradicciones:</strong> Descartar opciones que demuestren desinterés, negligencia, evasión de funciones, malgasto de recursos públicos, actitudes negativas hacia la entidad o cualquier forma de conflicto de interés.</li></ul>",
    "resources": [
        "Guía de Orientación al Aspirante - Pruebas Escritas (Proceso de Selección Distrito Capital 6)",
        "Manual Específico de Funciones y Competencias Laborales (Empleo Profesional Especializado - IDU)",
        "Código de Integridad Gente IDU (Versión 03) [Si está disponible, para comparar]",
        "Cartilla de Integridad Gente IDU (Versión 6.0) [Foco principal de estudio]",
        "Resolución 744 de 2024 (IDU)",
        "Ley 2195 de 2022 (Transparencia, Prevención y Lucha contra la Corrupción)",
        "Código Único de Integridad del Servicio Público Colombiano (DAFP)"
    ]




            },
            {"id": "integridad-diligencia", "title": "Diligencia", "content": "<p>La <strong>Diligencia</strong> es uno de los siete valores de integridad que estructuran el \"ADN IDU\". Es una cualidad esencial que guía la actuación del servidor público en el cumplimiento de sus responsabilidades, buscando la eficiencia y el uso óptimo de los recursos estatales.</p><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">I. ¿Qué es la Diligencia en el Contexto del IDU?</h4><p><strong>Definición oficial</strong> según la Cartilla de Integridad Gente IDU (Versión 6.0, página 8): \"Cumplimos los deberes, funciones y responsabilidades asignadas al cargo de la mejor manera posible, con atención, prontitud, destreza y eficiencia, para así optimizar el uso de los recursos del Estado.\"</p><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">Análisis de la Definición:</h5><p>Esta definición resalta varios aspectos fundamentales de la diligencia:</p><ul class=\"list-disc ml-5\"><li><strong>Integralidad en el Cumplimiento:</strong> No se trata solo de cumplir, sino de hacerlo \"de la mejor manera posible\".</li><li><strong>Cualidades Específicas:</strong> Implica actuar con:<ul class=\"list-circle ml-8 mt-1\"><li><strong>Atención:</strong> Prestando cuidado y detalle a las labores.</li><li><strong>Prontitud:</strong> Actuando con celeridad y sin demoras innecesarias.</li><li><strong>Destreza:</strong> Demostrando habilidad y pericia en la ejecución.</li><li><strong>Eficiencia:</strong> Logrando los resultados con el menor uso de recursos.</li></ul></li><li><strong>Propósito Superior:</strong> El fin último de esta manera de actuar es \"optimizar el uso de los recursos del Estado\", reconociendo que \"Lo público es de todos y todas y siempre se cuida\".</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">II. Comportamientos Éticos Asociados a la Diligencia (Lo que Hacemos y No Hacemos)</h4><p>La Cartilla de Integridad Gente IDU detalla explícitamente las conductas que demuestran diligencia y aquellas que la contradicen, lo cual es vital para la preparación de la prueba.</p><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">A. Comportamientos Deseables (Lo que hacemos):</h5><ul class=\"list-disc ml-5\"><li><strong>Uso Responsable de Recursos Públicos:</strong> \"Usamos responsablemente los recursos públicos para cumplir con nuestras obligaciones. Lo público es de todos y todas y siempre se cuida\". Esto implica evitar el desperdicio.</li><li><strong>Cumplimiento de Tiempos y Plazos:</strong> \"Cumplimos con los tiempos estipulados para el logro de cada obligación laboral, no dejamos para el otro día las tareas de hoy\".</li><li><strong>Garantía de Calidad:</strong> \"Aseguramos la calidad en cada uno de los productos que entregamos bajo los estándares del servicio público. No se valen las cosas a medias\".</li><li><strong>Proactividad y Mejora Continua:</strong> \"Siempre nos caracteriza la proactividad comunicando a tiempo propuestas para mejorar continuamente nuestra labor y la de las y los compañeros de trabajo\".</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">B. Comportamientos No Deseables (Lo que no hacemos):</h5><ul class=\"list-disc ml-5 text-red-700\"><li><strong>Malgasto de Recursos:</strong> \"Malgastamos los recursos públicos\". Contrario al uso responsable y la optimización.</li><li><strong>Postergación de Decisiones/Actividades:</strong> \"Postergamos las decisiones o actividades que den solución a problemáticas ciudadanas o que hagan parte del funcionamiento de nuestro cargo\". Esto atenta contra la prontitud y la eficiencia en la resolución de problemas ciudadanos.</li><li><strong>Desinterés/Negligencia:</strong> \"Demostramos desinterés en la atención a la ciudadanía y a las y a los demás servidores públicos\". Va en contra de la atención y la vocación de servicio.</li><li><strong>Evasión de Funciones:</strong> \"Evadimos nuestras funciones y responsabilidades\". Esto es una contradicción directa del cumplimiento de deberes.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">III. Articulación de la Diligencia con Otros Valores y el Marco Ético General</h4><p>La diligencia no opera de forma aislada; se complementa y fortalece con los otros valores de integridad del IDU y se enmarca en la ética del servicio público colombiano.</p><ul class=\"list-disc ml-5\"><li><strong>Con el Compromiso:</strong> La diligencia es una manifestación directa del compromiso. Un servidor comprometido dará lo mejor de sí, actuando con atención, prontitud y eficiencia para alcanzar los objetivos. La búsqueda de soluciones proactivas y no de justificaciones (Compromiso) se refleja en la prontitud y eficiencia de la Diligencia.</li><li><strong>Con la Honestidad:</strong> La diligencia de usar responsablemente los recursos públicos se vincula con la honestidad de \"cuidar los recursos públicos evidenciando siempre la ética\".</li><li><strong>Con el Respeto:</strong> La diligencia de no demostrar desinterés en la atención a la ciudadanía se entrelaza con el respeto de \"Atender con amabilidad, igualdad y equidad a todas las personas\".</li><li><strong>Con la Justicia:</strong> Actuar con diligencia contribuye a la imparcialidad y equidad, al cumplir las funciones de la mejor manera posible para todos los ciudadanos.</li><li><strong>Con la Innovación:</strong> La proactividad en la mejora continua (diligencia) impulsa la búsqueda de nuevas formas de enfrentar retos y optimizar procesos, pilares de la innovación.</li><li><strong>Con el Trabajo en Red:</strong> La integración de esfuerzos para el cumplimiento de labores y la comunicación clara y honesta (parte de la diligencia), son fundamentales para un trabajo conectado y articulado en red. La diligencia de \"no generar retrasos en el cumplimiento de los requerimientos para el desarrollo de los proyectos o actividades\" es crucial para la eficiencia en red.</li><li><strong>Marco Normativo Superior:</strong> Al igual que el Compromiso, la Diligencia se articula con la Constitución Política, el MIPG, el Código Disciplinario Único, el Estatuto Anticorrupción, la Ley 2195 de 2022 (transparencia y lucha contra la corrupción) y el Sistema de Gestión Antisoborno (ISO 37001). Ser diligente es acatar este marco legal y ético.</li><li><strong>Enfoque Preventivo en la Integridad:</strong> La diligencia es parte de las \"conductas positivas a favor de la legalidad, la vocación de servicio y el privilegio al bien general antes que al bien particular\". No postergar ni evadir es clave para prevenir actos que afecten la integridad pública.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">IV. Impacto de la Diligencia en el Desempeño del IDU y la Ciudadanía</h4><p>La diligencia es un factor clave para la eficiencia y eficacia del IDU:</p><ul class=\"list-disc ml-5\"><li><strong>Optimización de Recursos:</strong> Al actuar con eficiencia, atención, prontitud y destreza, se logra el uso óptimo de los recursos del Estado, lo que se traduce en más y mejores proyectos para Bogotá.</li><li><strong>Cumplimiento de Metas Institucionales:</strong> La garantía de calidad y el cumplimiento de tiempos son esenciales para alcanzar los objetivos del IDU en la ejecución de proyectos de infraestructura.</li><li><strong>Confianza Ciudadana:</strong> La prontitud en la atención de problemáticas ciudadanas y la garantía de calidad en los productos fortalecen la confianza de la ciudadanía en la entidad. \"Las personas necesitan saber que pueden confiar en nosotros, que haremos lo mejor que podamos\".</li><li><strong>Desarrollo Personal y Organizacional:</strong> La diligencia, cultivada día a día, permite el desarrollo no solo personal sino organizacional con eficiencia y eficacia, pues \"se trata de realizar cada actividad o función con esmero, responsabilidad, prontitud, empeño, transparencia y cuidado\".</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">V. Aspectos Clave para Preguntas CNSC (Tipo Integridad - Diligencia)</h4><p>Las preguntas sobre Diligencia en la prueba de Integridad evaluarán tu capacidad para aplicar este valor en situaciones cotidianas del servicio público, especialmente en el IDU.</p><ul class=\"list-disc ml-5\"><li><strong>Priorización de la Eficiencia y la Calidad:</strong> Siempre elige la opción que demuestre la búsqueda de la mejor manera posible de hacer las cosas, con altos estándares de calidad y eficiencia en el uso de recursos.</li><li><strong>Prontitud y Proactividad:</strong> La respuesta correcta a menudo implicará no postergar, no evadir, y tomar la iniciativa para resolver problemas a tiempo.</li><li><strong>Uso Responsable de Recursos:</strong> Busca opciones que reflejen el cuidado del patrimonio público, evitando el malgasto o el uso indebido.</li><li><strong>Atención y Vocación de Servicio al Ciudadano:</strong> La diligencia se manifiesta en una actitud atenta y dispuesta a resolver las necesidades de la ciudadanía y de los compañeros.</li><li><strong>Comunicación Oportuna y Constructiva:</strong> Relacionado con la proactividad para comunicar propuestas de mejora o problemas a tiempo.</li><li><strong>Evitar Justificaciones y Evasión:</strong> Descarta opciones que impliquen buscar excusas, culpar a otros o simplemente ignorar las responsabilidades.</li><li><strong>Contexto del IDU:</strong> Las preguntas pueden situarte en escenarios de proyectos de infraestructura, gestión de TI o atención ciudadana específicos del IDU. La aplicación de la diligencia debe ser pertinente a estos contextos.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">VI. Recursos Adicionales</h4><ul class=\"list-disc ml-5\"><li><strong>Cartilla de Integridad Gente IDU, versión 6 (2024):</strong> Páginas clave: 8 y 9, donde se detalla la definición, comportamientos deseados y no deseados.</li><li><strong>Código de Integridad del Servicio Público Colombiano (DAFP):</strong> Define la diligencia como un valor transversal obligatorio para todos los servidores públicos.</li><li><strong>Ley 2195 de 2022:</strong> Enmarca la diligencia dentro de los criterios para la prevención de la corrupción.</li><li><strong>Modelo Integrado de Planeación y Gestión (MIPG):</strong> Establece que la planeación, ejecución y evaluación de la gestión pública debe ser diligente y orientada a resultados.</li><li><strong>Código Disciplinario Único (Ley 734 de 2002):</strong> Artículos sobre negligencia.</li><li><strong>Subsistemas de Gestión del IDU:</strong> Explorar SGAS (Gestión Antisoborno), efr (Empresa Familiarmente Responsable), Gestión de Conocimiento, y Programa CALDAS.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">VII. Actividades y Consejos para Estudiar Diligencia</h4><p>Para una preparación efectiva del valor Diligencia en las pruebas CNSC, te sugiero las siguientes actividades y consejos:</p><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">A. Actividades Recomendadas:</h5><ul class=\"list-disc ml-5\"><li><strong>Día 1:</strong> Leer y subrayar la sección de Diligencia en la Cartilla de Integridad Gente IDU (páginas 8-9). Identificar las palabras clave de la definición.</li><li><strong>Día 2:</strong> Realizar una tabla comparativa personal de “Lo que hago” vs. “Lo que no hago” en tu experiencia laboral o académica, alineado con las conductas deseables y no deseables de la diligencia.</li><li><strong>Día 3:</strong> Escribir al menos 5 ejemplos reales de situaciones donde hayas demostrado actos diligentes y 2 donde quizás la diligencia fue desafiada, analizando por qué.</li><li><strong>Día 4:</strong> Crear simulacros tipo PJS específicos para el valor Diligencia. Considera casos donde la prontitud, la calidad o el uso de recursos sean el centro del dilema.</li><li><strong>Día 5:</strong> Debate (contigo mismo o con un compañero): ¿Cuál es la diferencia entre actuar con 'rapidez' y actuar con 'diligencia'? (La rapidez puede ser sin calidad o atención, la diligencia implica eficiencia y calidad).</li><li><strong>Día 6:</strong> Revisión de la Ley 2195 de 2022 y el Código Disciplinario Único (Ley 734 de 2002) en lo que respecta a la diligencia y prevención de la corrupción o sanciones por negligencia.</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">B. ¿Qué espera la CNSC cuando evalúan DILIGENCIA?</h5><p>Cuando te enfrentes a preguntas sobre Diligencia, la CNSC buscará saber si:</p><ul class=\"list-disc ml-5\"><li>Cumples tus funciones en tiempo y con calidad.</li><li>Tomas la iniciativa sin que te lo pidan (proactividad).</li><li>Priorizarías el bien público por encima de lo fácil.</li><li>Reconoces cuándo tu acción u omisión puede generar reprocesos.</li><li>Eres capaz de explicar cómo gestionas tu carga laboral para evitar negligencias.</li><li>Estás dispuesto a comunicar obstáculos y proponer soluciones a tiempo.</li></ul>", "resources": ["Cartilla Integridad Gente IDU"]},
            {"id": "integridad-honestidad", "title": "Honestidad", "content": "Honestidad es actuar con rectitud, transparencia y veracidad en todas las actuaciones, evitando el conflicto de intereses y la corrupción. Fundamental en la gestión de recursos públicos y procesos de contratación del IDU.", "resources": ["Cartilla Integridad Gente IDU"]},
            {"id": "integridad-innovacion", "title": "Innovación", "content": "Innovación es la capacidad de buscar y aplicar nuevas ideas y soluciones para mejorar procesos y servicios, fomentando la creatividad en el trabajo. En un rol de TI en el IDU, esto es vital para proponer soluciones de software de vanguardia.", "resources": ["Cartilla Integridad Gente IDU"]},
            {"id": "integridad-justicia", "title": "Justicia", "content": "Justicia es actuar con equidad, imparcialidad y respeto por los derechos de todas las personas, garantizando un trato igualitario y sin discriminación. Aplica a la atención al ciudadano y la gestión de proyectos que impactan a la comunidad.", "resources": ["Cartilla Integridad Gente IDU"]},
            {"id": "integridad-respeto", "title": "Respeto", "content": "Respeto es reconocer y valorar la dignidad de las personas, las instituciones y el medio ambiente, promoviendo un ambiente de armonía y tolerancia. Crucial en las interacciones con colegas, superiores, ciudadanos y contratistas del IDU.", "resources": ["Cartilla Integridad Gente IDU"]},
            {"id": "integridad-trabajo-en-red", "title": "Trabajo en Red", "content": "Trabajo en Red implica colaborar y coordinar esfuerzos con otras áreas y entidades para alcanzar objetivos comunes, compartiendo conocimientos y recursos. Como profesional TI del IDU, colaborarás constantemente con otras Secretarías y entidades distritales.", "resources": ["Cartilla Integridad Gente IDU"]}
        ]
    },
    {
        "id": "funcionales-generales",
        "title": "Competencias Funcionales Generales",
        "description": "Conocimientos y habilidades aplicables a cualquier cargo en el Distrito Capital.",
        "subtopics": [
            {"id": "funcionamiento-distrito", "title": "Funcionamiento del Distrito Capital", "content": "Comprende la estructura administrativa, los procesos clave y la interacción entre las entidades y la ciudadanía.", "resources": ["Constitución Política Art. 209", "Página Alcaldía Mayor de Bogotá", "Decreto Ley 1421 de 1993 (Estatuto Orgánico de Bogotá)"]},
            {
                "id": "organizacion-distrito",
                "title": "Organización del Distrito Capital",
                "content": "<p>La estructura administrativa de Bogotá, Distrito Capital, se organiza para la eficiente gestión de los asuntos públicos y la prestación de servicios a sus ciudadanos. Comprender esta organización es fundamental para cualquier servidor público, y especialmente para tu rol en el Instituto de Desarrollo Urbano (IDU).</p><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">I. Sector Central: El Núcleo de la Administración</h4><p>Este sector agrupa los organismos que definen las políticas y directrices generales del Distrito. Incluye:</p><ul class=\"list-disc ml-5\"><li><strong>Despacho del Alcalde/Alcaldesa Mayor:</strong> Es la máxima autoridad administrativa y política. Sus funciones son amplias y abarcan desde la dirección de la acción administrativa y la garantía de cumplimiento de la Constitución y las leyes, hasta el nombramiento de funcionarios clave (secretarios, gerentes de entidades descentralizadas) y la presentación de proyectos de acuerdo al Concejo. <br><em>Ejemplo Práctico:</em> Una nueva iniciativa de 'Gobierno Abierto' sería liderada y coordinada directamente por la Alcaldía Mayor.</li><li><strong>Consejos Superiores de la Administración Distrital:</strong> Son cuerpos colegiados que asesoran y coordinan la gestión del Alcalde Mayor en áreas específicas (ej. Consejo de Gobierno Distrital).</li><li><strong>Secretarías de Despacho:</strong> Son los pilares sectoriales. Cada Secretaría formula, coordina y ejecuta políticas públicas en su área (Hacienda, Salud, Educación, Planeación, etc.) bajo la dirección del Alcalde. <br><em>Ejemplo Práctico:</em> La Secretaría Distrital de Planeación (SDP) sería tu principal interlocutor para alinear los proyectos de infraestructura del IDU con el Plan de Desarrollo Urbano.</li><li><strong>Departamentos Administrativos:</strong> Cumplen funciones administrativas de apoyo para el Sector Central (ej. Departamento Administrativo del Servicio Civil Distrital - DASCD, que apoya en gestión pública).</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">II. Sector Descentralizado: La Ejecución Especializada</h4><p>Este sector está conformado por entidades con personería jurídica, autonomía administrativa y financiera, y patrimonio propio. Su función principal es la ejecución especializada de políticas y proyectos. Se clasifican en adscritas (vinculadas a una Secretaría o al Alcalde) y vinculadas (generalmente empresas industriales y comerciales).</p><ul class=\"list-disc ml-5\"><li><strong>Institutos Descentralizados (¡Tu Casa: IDU!):</strong> Son entidades técnicas que ejecutan políticas y proyectos específicos. El <strong>Instituto de Desarrollo Urbano (IDU)</strong> es un ejemplo clave y de gran relevancia para tu cargo.<ul class=\"list-circle ml-5 mt-2\"><li><strong>Naturaleza y Propósito del IDU:</strong> Su misión principal es <strong>\"ARTICULAR, EJECUTAR E IMPLEMENTAR LOS PROYECTOS DE DESARROLLO O CONSTRUCCION DE SOFTWARE, ADOPTANDO LOS ESTANDARES Y BUENAS PRACTICAS DE ARQUITECTURAS Y POLITICAS DE TI DEFINIDAS POR EL AREA CON EL FIN DE CUMPLIR CON LOS REQUERIMIENTOS DE LOS USUARIOS\"</strong>. Esto es la esencia de tu futuro rol.</li><li><strong>Funciones Esenciales de tu Empleo (Profesional Especializado en el IDU):</strong> Tu trabajo se centrará en la automatización de procesos, desarrollo de aplicaciones de alta calidad, ejecución del Plan Estratégico de TI y Comunicaciones (PETIC), gestión de requerimientos (funcionales y no funcionales), implementación de proyectos de software alineados con la arquitectura de sistemas de información, aseguramiento de documentación y trazabilidad, aplicación de normatividad en desarrollo de aplicaciones, adaptación de lineamientos de Arquitectura Empresarial (MAE), elaboración de documentación para contratación de aplicativos, y atención a entes de control.</li><li><strong>Conocimientos Básicos o Esenciales:</strong> Necesitarás dominar Contratación Estatal, Modelo de Arquitectura Empresarial (MAE), Desarrollo de sistemas de información, Gestión de Proyectos, Metodologías para modelamiento y construcción de SI, y Procesos administrativos de tecnología.</li><li><strong>Estructura Organizacional del IDU:</strong> Es vital conocer cómo se organiza el IDU. Cuenta con un Consejo Directivo, una Dirección General y Subdirecciones Generales (como la de Desarrollo Urbano, Infraestructura, Jurídica y Gestión Corporativa). Tu vacante como Profesional Especializado se ubica específicamente dentro de la <strong>Subdirección Técnica de Recursos Tecnológicos</strong>, que a su vez pertenece a la Subdirección General de Gestión Corporativa. Entender este organigrama te permitirá saber con quién interactuarás y dónde encaja tu rol. <br><em>Ejemplo Práctico:</em> Si necesitas información sobre una nueva regulación de contratación, tu consulta iría a la Subdirección Jurídica del IDU, no directamente a una Secretaría Distrital.</li></ul></li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">III. Sector de las Localidades: La Gestión Local</h4><p>Este sector se encarga de la administración de los asuntos a nivel local. Comprende las Alcaldías Locales y los Fondos de Desarrollo Local, que ejecutan proyectos directamente en las veinte localidades de Bogotá.</p><ul class=\"list-disc ml-5\"><li><em>Ejemplo Práctico:</em> Un proyecto de mejoramiento de una vía local que afecte a una sola localidad sería gestionado y financiado en coordinación con la Alcaldía Local correspondiente.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">IV. Órganos de Control del Distrito: Garantizando Transparencia y Legalidad</h4><p>Aunque no forman parte de la administración directa, estos órganos son cruciales para la supervisión y la transparencia del Distrito Capital.</p><ul class=\"list-disc ml-5\"><li><strong>Concejo de Bogotá D.C.:</strong> Es la suprema autoridad normativa del Distrito. Expide <strong>Acuerdos</strong> (equivalentes a leyes a nivel distrital) sobre el Plan de Desarrollo, la estructura administrativa, urbanismo, y el endeudamiento. Vigila y controla la gestión de las autoridades distritales. Es quien aprueba tu cargo y las funciones generales de tu entidad. <br><em>Importante:</em> Los 'Acuerdos de la Alcaldía Mayor' mencionados en algunas guías se refieren a los Acuerdos del Concejo que rigen la administración distrital. El Alcalde y las Secretarías expiden Decretos y Resoluciones.</li><li><strong>Contraloría de Bogotá D.C.:</strong> Órgano de control fiscal. Vigila la gestión de los recursos del Distrito, auditando la eficiencia y efectividad del gasto público. <br><em>Ejemplo Práctico:</em> Tu área en el IDU podría ser auditada por la Contraloría para verificar la correcta ejecución presupuestal de un proyecto de software.</li><li><strong>Personería de Bogotá D.C.:</strong> Ejerce funciones de Ministerio Público y defensor de los derechos humanos. Vigila la conducta de los servidores públicos y protege los derechos fundamentales de los ciudadanos. <br><em>Ejemplo Práctico:</em> Si un ciudadano tiene una queja sobre la atención recibida en el IDU o sobre una afectación de sus derechos, podría acudir a la Personería.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">Relación e Interacción: La Dinámica del Distrito</h4><p>Es vital comprender cómo todos estos componentes interactúan para el funcionamiento armónico del Distrito:</p><ul class=\"list-disc ml-5\"><li>El <strong>Alcalde Mayor</strong> lidera la administración central, ejecutando las políticas y programas.</li><li>El <strong>Concejo de Bogotá</strong> provee el marco normativo a través de sus Acuerdos, que definen cómo se estructura y opera la administración.</li><li>Las <strong>Secretarías</strong> formulan políticas sectoriales (ej. Secretaría de Planeación para desarrollo urbano, Secretaría de Hacienda para presupuesto).</li><li>Los <strong>Institutos Descentralizados (como el IDU)</strong> ejecutan proyectos y programas específicos bajo la dirección de las Secretarías sectoriales o la Alcaldía Mayor. Por ejemplo, el IDU ejecuta los planes de infraestructura que la Secretaría de Planeación define y el Concejo aprueba.</li><li>Los <strong>Órganos de Control</strong> supervisan a toda la administración para garantizar la legalidad, transparencia y el respeto por los derechos de los ciudadanos.</li></ul><p><em>Ejemplo de Pregunta (PJS) Orientada a tu rol:</em></p><div class=\"bg-gray-100 p-4 rounded-lg border border-gray-300 mt-4\"><p class=\"font-bold mb-2\">Caso:</p><p>Una nueva política de infraestructura tecnológica distrital ha sido aprobada mediante Acuerdo por el Concejo de Bogotá. Como Profesional Especializado del IDU, se te encarga la implementación de un componente específico de desarrollo de software para esta política, que requiere la alineación con los planes estratégicos de otras entidades distritales y la gestión eficiente de recursos presupuestales.</p><p class=\"font-bold mt-3 mb-2\">Enunciado:</p><p>¿Cuál de las siguientes acciones refleja una comprensión adecuada de la cadena de mando y coordinación en el Distrito Capital para la ejecución de esta política, considerando tu rol en el IDU?</p><ul class=\"list-unstyled space-y-1 mt-2\"><li>A) Iniciar directamente el desarrollo del software, asumiendo que el Acuerdo del Concejo ya proporciona todas las directrices técnicas y presupuestales específicas.</li><li>B) Coordinar con la Secretaría Distrital de Planeación para asegurar la alineación del componente de software con el Plan de Desarrollo Distrital, y con la Secretaría de Hacienda para validar la disponibilidad y asignación presupuestal específica para el proyecto en el IDU.</li><li>C) Presentar un informe preliminar de avance a la Contraloría de Bogotá para que realice una auditoría preventiva sobre la etapa inicial del proyecto y su asignación de recursos.</li></ul><p class=\"font-bold mt-3 mb-2\">Respuesta Correcta: B)</p><p class=\"text-sm\"><strong>Explicación:</strong> La opción B demuestra una comprensión clara de la interacción interinstitucional. Una política aprobada por el Concejo requiere la coordinación con la Secretaría de Planeación (para alineación estratégica) y Hacienda (para presupuesto) antes de la ejecución por una entidad descentralizada como el IDU. La opción A ignora la necesidad de coordinación y planificación detallada. La opción C es prematura; la Contraloría realiza control fiscal posterior o preventivo, pero no inicia auditorías sobre etapas tempranas de un proyecto sin un proceso establecido o indicio de irregularidad.</p></div>",
                "resources": [
                    "Decreto Ley 1421 de 1993 (Estatuto Orgánico de Bogotá D.C.)",
                    "Página web del Concejo de Bogotá D.C. (para Acuerdos)",
                    "Página web de la Contraloría de Bogotá D.C.",
                    "Página web de la Personería de Bogotá D.C.",
                    "Organigrama del IDU y Manual de Funciones de tu cargo (OPEC 210171)"
                ]
            },
            {"id": "razonamiento-analitico",
    "title": "Razonamiento Analítico",
    "content": "<p>El <strong>Razonamiento Analítico</strong> es la capacidad de interpretar, analizar y resolver problemas lógicos y abstractos. Implica la habilidad para descomponer información compleja en partes más pequeñas, identificar patrones, inferir conclusiones a partir de premisas dadas y aplicar principios lógicos o matemáticos para llegar a una solución. Es una habilidad crucial para el éxito en cualquier empleo público, ya que permite a los servidores públicos tomar decisiones informadas y resolver problemas eficientemente en su gestión diaria.</p><p>En las pruebas de la CNSC, el razonamiento analítico se evalúa a través de diversas categorías:</p><ul class=\"list-disc ml-5\"><li>Comprensión de Lectura (Razonamiento Verbal)</li><li>Inferencia Lógica</li><li>Resolución de Problemas Matemáticos Básicos (Razonamiento Cuantitativo)</li><li>Análisis de Gráficos o Tablas (Interpretación de Datos)</li><li>Razonamiento Abstracto (Identificación de Patrones)</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">II. Componentes Clave del Razonamiento Analítico en las Pruebas CNSC</h4><p>Para cada componente, se describe lo que implica, los tipos de preguntas comunes y estrategias de preparación.</p><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">1. Comprensión de Lectura (Razonamiento Verbal)</h5><p><strong>¿Qué Implica?</strong> Es la capacidad de entender el significado de un texto, tanto a nivel literal como inferencial. Implica identificar la idea principal, los argumentos secundarios, el propósito del autor, el tono, y la relación entre diferentes partes del texto.</p><h6 class=\"text-md font-semibold mt-2 mb-1 text-gray-700\">Tipos de Preguntas Comunes:</h6><ul class=\"list-disc ml-5\"><li>Identificación de la idea central o tesis del texto.</li><li>Reconocimiento de argumentos y contraargumentos.</li><li>Inferencia de información no explícita, pero que se desprende lógicamente del texto.</li><li>Identificación del propósito o la intención del autor.</li><li>Determinación del significado de palabras o frases en un contexto específico.</li><li>Reconocimiento de la estructura del texto (comparación, causa-efecto, problema-solución).</li></ul><h6 class=\"text-md font-semibold mt-2 mb-1 text-gray-700\">Estrategias de Preparación:</h6><ul class=\"list-disc ml-5\"><li><strong>Lectura Activa:</strong> No leas pasivamente. Subraya, anota, hazte preguntas mientras lees.</li><li><strong>Identifica la Idea Principal:</strong> ¿De qué trata el texto? ¿Cuál es el mensaje central?</li><li><strong>Palabras Clave:</strong> Presta atención a conectores lógicos (sin embargo, por lo tanto, además, a pesar de) que indican relaciones entre ideas.</li><li><strong>Inferencias:</strong> Distingue lo que el texto <em>dice</em> de lo que el texto <em>sugiere</em> o implica lógicamente. Una inferencia es una conclusión que se deriva del texto, aunque no esté explícita.</li><li><strong>Practica con Textos Variados:</strong> Lee artículos de opinión, textos científicos divulgativos, fragmentos de ensayos, noticias complejas.</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">2. Inferencia Lógica</h5><p><strong>¿Qué Implica?</strong> Es la habilidad para extraer conclusiones válidas a partir de un conjunto de premisas o afirmaciones dadas. Se trata de determinar qué se sigue necesariamente de la información presentada, sin añadir información externa.</p><h6 class=\"text-md font-semibold mt-2 mb-1 text-gray-700\">Tipos de Preguntas Comunes:</h6><ul class=\"list-disc ml-5\"><li>Silogismos: Dadas dos o más proposiciones, determinar una conclusión válida.</li><li>Razonamiento deductivo: Partir de principios generales para llegar a conclusiones específicas.</li><li>Razonamiento inductivo: Partir de casos específicos para inferir principios generales (aunque con menor certeza que la deducción).</li><li>Identificación de falacias o errores en el razonamiento.</li><li>Completar secuencias lógicas o patrones numéricos y figurativos.</li></ul><h6 class=\"text-md font-semibold mt-2 mb-1 text-gray-700\">Estrategias de Preparación:</h6><ul class=\"list-disc ml-5\"><li><strong>Identifica Premisas y Conclusión:</strong> Separa claramente la información dada (premisas) de lo que se debe deducir.</li><li><strong>Diagramas:</strong> Para silogismos o relaciones, utiliza diagramas de Venn o tablas para visualizar la información.</li><li><strong>No asumas:</strong> Basa tus conclusiones <em>únicamente</em> en la información proporcionada. Evita la información externa o el conocimiento previo no explicitado.</li><li><strong>Práctica de Problemas de Lógica:</strong> Resuelve ejercicios de lógica formal e informal.</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">3. Resolución de Problemas Matemáticos Básicos (Razonamiento Cuantitativo)</h5><p><strong>¿Qué Implica?</strong> Evalúa la capacidad para aplicar conceptos matemáticos fundamentales (aritmética, álgebra básica, geometría básica, porcentajes, proporciones) para resolver problemas de la vida cotidiana o del ámbito laboral. Se enfoca en la lógica y el análisis más que en cálculos complejos.</p><h6 class=\"text-md font-semibold mt-2 mb-1 text-gray-700\">Tipos de Preguntas Comunes:</h6><ul class=\"list-disc ml-5\"><li>Operaciones básicas: Suma, resta, multiplicación, división con números enteros, decimales y fracciones.</li><li>Porcentajes y proporciones: Cálculos de aumentos, descuentos, relaciones proporcionales.</li><li>Regla de tres simple y compuesta.</li><li>Problemas con unidades de medida (tiempo, distancia, volumen, etc.).</li><li>Área y perímetro de figuras geométricas básicas.</li><li>Interpretación de datos en tablas y gráficos (a menudo se solapa con el punto 4).</li></ul><h6 class=\"text-md font-semibold mt-2 mb-1 text-gray-700\">Estrategias de Preparación:</h6><ul class=\"list-disc ml-5\"><li><strong>Repasa Fundamentos:</strong> Asegúrate de dominar las operaciones básicas, porcentajes, proporciones y regla de tres.</li><li><strong>Transforma el Problema:</strong> Lee el problema cuidadosamente, identifica los datos y lo que se pide. Convierte el lenguaje cotidiano en expresiones matemáticas.</li><li><strong>Simplifica Cálculos:</strong> Busca métodos abreviados o aproximaciones cuando sea posible, sin sacrificar precisión si es requerida.</li><li><strong>Práctica Constante:</strong> La clave es resolver muchos problemas para familiarizarte con los distintos tipos y desarrollar agilidad.</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">4. Análisis de Gráficos o Tablas (Interpretación de Datos)</h5><p><strong>¿Qué Implica?</strong> Es la habilidad para extraer información relevante, identificar tendencias, comparar datos y sacar conclusiones a partir de la representación visual o tabular de información cuantitativa.</p><h6 class=\"text-md font-semibold mt-2 mb-1 text-gray-700\">Tipos de Gráficos/Tablas Comunes:</h6><ul class=\"list-disc ml-5\"><li>Gráficos de barras, circulares (tortas), de líneas.</li><li>Tablas de datos (frecuencias, comparaciones).</li><li>Histogramas, diagramas de dispersión.</li></ul><h6 class=\"text-md font-semibold mt-2 mb-1 text-gray-700\">Estrategias de Preparación:</h6><ul class=\"list-disc ml-5\"><li><strong>Lee Títulos y Ejes:</strong> Comprende qué representa cada parte del gráfico o tabla.</li><li><strong>Identifica la Unidad de Medida:</strong> Asegúrate de entender las escalas y unidades.</li><li><strong>Tendencias y Patrones:</strong> Busca aumentos, disminuciones, picos, valles, relaciones directas o inversas.</li><li><strong>Comparaciones:</strong> Compara categorías, periodos de tiempo o grupos de datos.</li><li><strong>Calcula Porcentajes y Promedios:</strong> A menudo se te pedirá calcular valores derivados de los datos presentados.</li><li><strong>No Extrapoles sin Justificación:</strong> Saca conclusiones basadas <em>solo</em> en los datos presentados, a menos que se te pida explícitamente inferir tendencias futuras con base en el patrón.</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">5. Razonamiento Abstracto (Identificación de Patrones)</h5><p><strong>¿Qué Implica?</strong> Es la capacidad de identificar patrones, reglas o relaciones en series de figuras, símbolos o matrices. No requiere conocimiento previo, sino la habilidad para abstraer la lógica subyacente y predecir el siguiente elemento o identificar el elemento discordante.</p><h6 class=\"text-md font-semibold mt-2 mb-1 text-gray-700\">Tipos de Preguntas Comunes:</h6><ul class=\"list-disc ml-5\"><li>Series de figuras: Identificar la figura que continúa una secuencia lógica.</li><li>Matrices de figuras: Identificar la figura faltante en una matriz basada en patrones horizontales y verticales.</li><li>Figuras discordantes: Identificar la figura que no sigue el patrón o regla común al resto del grupo.</li><li>Analogías de figuras: Relacionar figuras con base en transformaciones (rotación, traslación, inversión, adición/sustracción de elementos, cambios de color/forma).</li></ul><h6 class=\"text-md font-semibold mt-2 mb-1 text-gray-700\">Estrategias de Preparación:</h6><ul class=\"list-disc ml-5\"><li><strong>Observación Detallada:</strong> Presta atención a cada detalle de las figuras: forma, tamaño, color, posición, orientación, número de elementos.</li><li><strong>Busca un Patrón Lógico:</strong> ¿Hay rotación? ¿Reflexión? ¿Incremento/decremento de elementos? ¿Cambio de color? ¿Combinación de reglas?</li><li><strong>Prueba Hipótesis:</strong> Si crees que encontraste una regla, aplícala a los siguientes elementos de la serie para ver si se mantiene.</li><li><strong>Descomposición:</strong> Si la figura es compleja, analiza sus componentes por separado (ej., un elemento rota, otro cambia de color).</li><li><strong>Eliminación:</strong> Descarta las opciones que claramente no siguen ningún patrón.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">III. Consejos Generales para la Preparación y el Examen</h4><ul class=\"list-disc ml-5\"><li><strong>Práctica Constante:</strong> El razonamiento analítico es una habilidad que mejora significativamente con la práctica. Resuelve muchos ejercicios de cada tipo.</li><li><strong>Gestiona el Tiempo:</strong> Las preguntas de razonamiento a menudo tienen un tiempo limitado. Practica bajo presión para mejorar tu agilidad. Si una pregunta te toma demasiado tiempo, déjala y vuelve a ella si te queda tiempo.</li><li><strong>Lee Cuidadosamente:</strong> En todas las secciones, la interpretación correcta del enunciado, los datos o el texto es el primer paso y el más crucial. Un error de lectura lleva a un error de respuesta.</li><li><strong>Familiarízate con el Formato CNSC:</strong> Utiliza simulacros de la CNSC para entender el estilo y la dificultad de las preguntas.</li><li><strong>No Asumas:</strong> En preguntas de lógica e interpretación de datos, solo utiliza la información explícitamente dada. No añadas información externa.</li><li><strong>Identifica tus Debilidades:</strong> Después de practicar, analiza qué tipos de preguntas se te dificultan más y dedícales más tiempo de estudio.</li><li><strong>Descansa Bien:</strong> El razonamiento analítico exige concentración. Un buen descanso antes del examen es fundamental.</li></ul><div class=\"mt-8 p-4 bg-purple-50 rounded-lg border-l-4 border-purple-500 text-purple-800\"><p class=\"font-semibold mb-3\">¡Desafía tu Lógica y Análisis!</p><button id=\"start-razonamiento-quiz-btn\" class=\"bg-purple-600 text-white px-6 py-3 rounded-lg font-semibold hover:bg-purple-700 transition duration-300 transform hover:scale-105\">Realizar Simulacro de Razonamiento Analítico</button></div>",
    "resources": [
        "Ejercicios de lógica",
        "Guías de razonamiento verbal y cuantitativo",
        "Simulacros de la CNSC de razonamiento abstracto",
        "Guía CNSC de Razonamiento Abstracto (PDF oficial)",
        "Khan Academy (para ejercicios de lógica y matemáticas)",
        "Plataformas online de pruebas CNSC (ej. 'Simo CNSC')"
        
        ]}
        ]
    },
    {
        "id": "funcionales-especificas",
        "title": "Competencias Funcionales Específicas",
        "description": "Conocimientos técnicos relacionados directamente con tu rol como Profesional Especializado.",
        "subtopics": [
            {
    "id": "arquitectura-empresarial",
    "title": "Arquitectura Empresarial",
    "content": "<p>La <strong>Arquitectura Empresarial (AE)</strong> es una práctica estratégica que permite materializar y llevar a cabo la visión organizacional y misional de una entidad, usando la tecnología de manera repetible, perdurable y sostenible. Consiste en analizar integralmente las entidades desde diferentes perspectivas o dimensiones, con el propósito de obtener, evaluar y diagnosticar su estado actual, establecer el estado deseado y plantear un mapa de ruta de transformación digital.</p><p>El <strong>Modelo de Arquitectura Empresarial (MAE) del MinTIC</strong> es la herramienta que el Ministerio pone a disposición de todas las entidades públicas colombianas para lograr su transformación digital. Es un marco de referencia que proporciona un conjunto de lineamientos, establece dominios, brinda guías metodológicas, y recomienda herramientas y mejores prácticas para orientar a las Entidades públicas en la aplicación del enfoque de Arquitectura Empresarial para dar solución a problemas.</p><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">Propósito y Objetivos del MAE:</h4><ul class=\"list-disc ml-5\"><li>Soportar el habilitador de Arquitectura de la Política de Gobierno Digital.</li><li>Ayudar a las entidades públicas a consolidar los procesos de transformación digital y contribuir a la generación de valor público.</li><li>Establecer los principios y lineamientos para la arquitectura empresarial, la gestión y desarrollo de proyectos con componentes de tecnologías de la información de las entidades públicas.</li><li>Generar soluciones, trámites y servicios innovadores que satisfagan las necesidades de los ciudadanos.</li><li>Permitir a las entidades incorporar las Tecnologías de Información como habilitadoras de su estrategia y operación, focalizando sus iniciativas en la optimización de recursos y la generación de resultados.</li><li>Orientar todo el ciclo de desarrollo y gestión de capacidades habilitadas con tecnología para lograr la transformación digital y la generación de valor público.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">II. Estructura y Dominios del MAE</h4><p>El Marco de Referencia de Arquitectura Empresarial (MRAE) describe la estructura y modelos, las capacidades institucionales y de TI que se buscan desarrollar o fortalecer en las entidades públicas, la normatividad asociada, los principios y los dominios y componentes asociados a cada uno de los modelos que lo conforman.</p><p>El MAE se basa en el trabajo integral de seis dominios principales, que son las dimensiones desde las cuales se debe abordar el análisis y diseño de los ejercicios de AE, la gestión y gobierno de TI, y la gestión de proyectos de TI:</p><ul class=\"list-disc ml-5\"><li><strong>Dominio de Arquitectura Institucional:</strong><ul class=\"list-circle ml-5 mt-1\"><li>Propósito: Guía estratégicamente a las personas, los procesos y las inversiones para generar cambios organizacionales significativos que deriven en el cumplimiento de los objetivos institucionales.</li><li>Enfoque: Conecta la estrategia de la entidad (objetivos estratégicos, misión, visión) con el modelo operativo.</li></ul></li><li><strong>Dominio de Arquitectura de Información:</strong><ul class=\"list-circle ml-5 mt-1\"><li>Propósito: Busca determinar los datos e información clave para las entidades, estableciendo cómo obtenerlos, organizarlos y distribuirlos de manera que faciliten el desarrollo de la misión de las entidades de manera eficiente.</li><li>Enfoque: Gestión de los datos como activo estratégico.</li></ul></li><li><strong>Dominio de Arquitectura de Sistemas de Información:</strong><ul class=\"list-circle ml-5 mt-1\"><li>Propósito: Permite planear y diseñar la arquitectura, el ciclo de vida, las aplicaciones, los soportes y la gestión de los sistemas de información que habilitan el cumplimiento de las funciones de una entidad pública.</li><li>Enfoque: Planificación y diseño de las aplicaciones y sistemas.</li></ul></li><li><strong>Dominio de Arquitectura Tecnológica:</strong><ul class=\"list-circle ml-5 mt-1\"><li>Propósito: Define la infraestructura tecnológica (hardware, software base, redes) necesaria para soportar los sistemas de información y los procesos de negocio.</li><li>Enfoque: Asegurar la plataforma tecnológica.</li></ul></li><li><strong>Dominio de Arquitectura de Seguridad:</strong><ul class=\"list-circle ml-5 mt-1\"><li>Propósito: Garantizar la confidencialidad, integridad y disponibilidad de la información y los sistemas, así como la continuidad del servicio frente a riesgos de seguridad.</li><li>Enfoque: Protección de activos de información.</li></ul></li><li><strong>Dominio de Uso y Apropiación de la práctica de AE:</strong><ul class=\"list-circle ml-5 mt-1\"><li>Propósito: Fomentar la adopción, comprensión y aplicación efectiva de los principios y lineamientos de Arquitectura Empresarial dentro de la entidad, asegurando que se convierta en una práctica cultural.</li><li>Enfoque: Gestión del cambio cultural y del talento humano.</li></ul></li></ul><p>Estos seis dominios, al trabajarse de forma integral, permiten a las entidades públicas incorporar las Tecnologías de Información como habilitadoras de su estrategia y operación.</p><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">III. Principios del MAE</h4><p>Los principios del MAE son un conjunto de enunciados de alto nivel que guían su adopción y reflejan los valores y convicciones que las Entidades de la administración pública deben tener en cuenta al gestionar las tecnologías de la información. Aunque no se listan explícitamente todos en las fuentes proporcionadas, se entiende que guían la articulación de la orientación estratégica, el modelo de gestión, el plan de transformación digital y la estrategia de Tecnologías de Información y las Comunicaciones.</p><ul class=\"list-disc ml-5\"><li><strong>Alineación Estratégica:</strong> Conectar la estrategia de la entidad con el modelo operacional y la gestión, usando la tecnología.</li><li><strong>Interoperabilidad:</strong> Los sistemas deben comunicarse entre sí.</li><li><strong>Reutilización:</strong> Evitar duplicar soluciones tecnológicas.</li><li><strong>Seguridad:</strong> Proteger datos sensibles.</li><li><strong>Eficiencia:</strong> Optimizar el uso de los recursos tecnológicos.</li><li><strong>Transparencia:</strong> Promover la apertura y accesibilidad de la información.</li><li><strong>Generación de Valor Público:</strong> Dirigir los esfuerzos tecnológicos hacia la creación de soluciones, trámites y servicios innovadores que satisfagan las necesidades de los ciudadanos.</li><li><strong>Integralidad:</strong> Abordar el análisis y diseño de la entidad desde diferentes perspectivas o dimensiones de forma holística.</li><li><strong>Optimización de Recursos y Resultados:</strong> Focalizar las iniciativas en la eficiencia y la consecución de resultados.</li><li><strong>Adaptación de Mejores Prácticas:</strong> El MAE adopta mejores prácticas del mercado como ITIL, COBIT, PMI, ISO, y puede complementarse con otros marcos metodológicos como TOGAF o ZACHMAN.</li><li><strong>Sostenibilidad y Repetibilidad:</strong> Materializar la visión organizacional de una manera repetible, perdurable y sostenible.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">IV. Aplicación del MAE en el Sector Público Colombiano</h4><p>El MAE apoya la gestión de TI en los organismos de la rama Ejecutiva, tanto del orden nacional como territorial, y en las demás entidades que decidan adoptar estas prácticas. Su aplicación es fundamental para la Política de Gobierno Digital.</p><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">Dimensiones de la Transformación Digital habilitadas por el MAE:</h5><p>El MAE aborda la transformación digital desde dos dimensiones principales:</p><ul class=\"list-disc ml-5\"><li><strong>Gestión y Operación:</strong> En esta dimensión se define y gestiona el modelo operativo de la entidad: los procesos, el talento humano y la cultura organizacional, entre otros. Estos deben estar alineados con la Estrategia y con la Tecnología e Información.</li><li><strong>Tecnología e Información:</strong> En esta dimensión se gestionan las capacidades tecnológicas a través de los dominios de información o datos, sistemas de información, tecnología y seguridad. Estos deben estar alineados con la Estrategia y la Gestión y Operación.</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">Modelos Asociados al MRAE (Versión 3.0):</h5><p>Además del Modelo de Arquitectura Empresarial (MAE), el MinTIC ha desarrollado otros modelos que complementan el marco:</p><ul class=\"list-disc ml-5\"><li><strong>Modelo de Gestión y Gobierno de TI (MGGTI):</strong> Permite generar las capacidades institucionales de TI que se requieren para prestar servicios de TI a los usuarios de cada entidad mediante el uso adecuado de las tecnologías de la información y las comunicaciones. Se enfoca en impulsar la provisión de servicios digitales de confianza y calidad, procesos internos seguros y eficientes, toma de decisiones basada en datos, y el desarrollo de un Estado Abierto.</li><li><strong>Modelo de Gestión de Proyectos TI (MGPTI):</strong> Orientado a la gestión eficiente de los proyectos de tecnología de la información.</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">Entregables y Productos de la Aplicación del MAE (Versión 3):</h5><p>La implementación del MAE genera productos concretos que demuestran el avance de la entidad en su transformación digital:</p><ul class=\"list-disc ml-5\"><li>Evaluación del nivel de madurez de Arquitectura Empresarial.</li><li>Plan de acción resultado de la evaluación de madurez.</li><li>Catálogo de sistemas de información.</li><li>Catálogo de infraestructura.</li><li>Catálogo de servicios tecnológicos.</li><li>Lecciones aprendidas en el desarrollo del proyecto.</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">Beneficios de la Adopción del MAE:</h5><ul class=\"list-disc ml-5\"><li>Conectar la estrategia con el modelo operacional y la gestión, usando la tecnología de manera efectiva.</li><li>Generar soluciones, trámites y servicios innovadores que satisfagan las necesidades de los ciudadanos.</li><li>Transformar los procesos digitales de las entidades.</li><li>Optimizar recursos y generar resultados en la operación.</li><li>Fortalecer la gobernanza de la infraestructura de datos del Estado.</li></ul><p>La aplicación de los lineamientos del Marco de Referencia de Arquitectura Empresarial garantiza el cumplimiento de los logros del Manual de Gobierno en Línea, contribuyendo a la visión de un 'Gobierno Digital' que presta mejores servicios con la colaboración de toda la sociedad, mediante el aprovechamiento de las TIC.</p><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">V. Preparación para la Prueba CNSC (Enfoque en Arquitectura Empresarial)</h4><p>Para prepararte eficazmente para la prueba de la CNSC en el tema de Arquitectura Empresarial, considera lo siguiente:</p><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">A. Estrategia de Estudio:</h5><ul class=\"list-disc ml-5\"><li><strong>Lectura del Marco de Referencia:</strong> Comprende la estructura y objetivos del MAE en su totalidad.</li><li><strong>Estudio de los Dominios:</strong> Profundiza en cada uno de los seis dominios de Arquitectura (Institucional, Información, Sistemas de Información, Tecnológica, Seguridad, Uso y Apropiación). Entiende su propósito y enfoque.</li><li><strong>Análisis de Principios:</strong> Memoriza y comprende los principios del MAE y cómo se aplican en la práctica.</li><li><strong>Identificación de Entregables:</strong> Conoce los productos concretos que resultan de la implementación del MAE.</li><li><strong>Casos Prácticos Aplicados:</strong> Intenta relacionar cada concepto y principio con ejemplos de la vida real en entidades públicas, especialmente en una como el IDU.</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">B. Consejos para la Prueba CNSC (Preguntas de Juicio Situacional y Conocimiento):</h5><ul class=\"list-disc ml-5\"><li><strong>Enfoque en Alineación Estratégica:</strong> Siempre busca la opción que conecte el uso de TI con los objetivos misionales de la entidad y la generación de valor público.</li><li><strong>Reconocimiento de Dominios:</strong> Sé capaz de identificar a qué dominio del MAE se refiere una situación o una pregunta específica.</li><li><strong>Aplicación de Principios:</strong> Si una pregunta presenta un dilema o una decisión, elige la opción que mejor refleje los principios del MAE (interoperabilidad, reutilización, seguridad, eficiencia, etc.).</li><li><strong>Diferenciación de Modelos:</strong> No confundas el MAE con el MGGTI o el MGPTI; entiende el rol específico de cada uno.</li><li><strong>Rol Habilitador de la TI:</strong> Recuerda que la TI es una herramienta para la transformación y la eficiencia del Estado.</li><li><strong>Respuestas Específicas:</strong> Evita respuestas genéricas. Las opciones correctas suelen ser específicas sobre los conceptos y la terminología del MAE.</li><li><strong>Énfasis en el IDU:</strong> Considera cómo el MAE aplicaría a los proyectos y la estructura del IDU.</li></ul><div class=\"mt-8 p-4 bg-blue-50 rounded-lg border-l-4 border-blue-500 text-blue-800\"><p class=\"font-semibold mb-3\">¡Pon a prueba tu conocimiento de Arquitectura Empresarial!</p><button id=\"start-ae-quiz-btn\" class=\"bg-blue-600 text-white px-6 py-3 rounded-lg font-semibold hover:bg-blue-700 transition duration-300 transform hover:scale-105\">Realizar Simulacro de Arquitectura Empresarial</button></div>",
    "resources": [
        "Marco de Referencia de Arquitectura Empresarial (MRAE) - MinTIC",
        "Guías de implementación del MAE en el sector público colombiano",
        "Página de Gobierno Digital Colombia (MinTIC)",
        "Resolución 1514 de 2020 (Política de Seguridad Digital)",
        "Ley 2015 de 2020 (Gobierno Digital)"
    ]
},
            


{
    "id": "contratacion-publica",
    "title": "Contratación Pública Aplicada Ingeniería",
    "content": "<p>La <strong>contratación pública en Colombia</strong> es el conjunto de normas y procedimientos que rigen la adquisición de bienes, obras y servicios por parte de las entidades estatales. Su objetivo principal es garantizar que el Estado obtenga las mejores condiciones en sus compras, optimizando el uso de los recursos públicos, fomentando la transparencia y promoviendo la participación de la industria nacional.</p><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">I. Marco Normativo Clave</h4><p>El sistema de contratación estatal colombiano se rige principalmente por tres cuerpos normativos fundamentales:</p><ul class=\"list-disc ml-5\"><li><strong>Ley 80 de 1993 (Estatuto General de Contratación de la Administración Pública):</strong><ul class=\"list-circle ml-5 mt-1\"><li>Es el Estatuto General de Contratación de la Administración Pública.</li><li>Establece las normas, principios y procedimientos para los contratos que celebran las entidades estatales.</li><li>Define el ámbito de aplicación, los principios generales (como transparencia, economía, responsabilidad), la capacidad para contratar, las inhabilidades e incompatibilidades, y los tipos de contratos (obra, consultoría, interadministrativo, suministro, prestación de servicios, etc.).</li><li>Su objetivo es lograr los fines estatales de manera eficiente.</li></ul></li><li><strong>Ley 1150 de 2007 (Modificaciones a la Ley 80):</strong><ul class=\"list-circle ml-5 mt-1\"><li>Introduce modificaciones sustanciales a la Ley 80 de 1993, buscando mayor eficiencia y transparencia en los procesos de selección.</li><li>Establece y clasifica las modalidades de selección del contratista (Licitación Pública, Selección Abreviada, Concurso de Méritos, Contratación Directa, y Mínima Cuantía).</li><li>Generaliza la obligatoriedad del uso de la contratación electrónica a través del Sistema Electrónico para la Contratación Pública (SECOP I y II).</li><li>Exige que cada entidad expida un manual de contratación para sus procesos.</li></ul></li><li><strong>Decreto 1082 de 2015 (Decreto Único Reglamentario del Sector Administrativo de Planeación Nacional):</strong><ul class=\"list-circle ml-5 mt-1\"><li>Es el Decreto Único Reglamentario del Sector Administrativo de Planeación Nacional.</li><li>Compila y reglamenta de manera detallada las actividades de contratación de las entidades públicas, unificando la normativa anterior dispersa.</li><li>Desarrolla en profundidad las modalidades de selección y los procedimientos asociados a cada una de ellas, brindando claridad operativa a lo establecido en la Ley 80 y la Ley 1150.</li></ul></li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">II. Principios de la Contratación Pública</h4><p>Los principios son el fundamento ético y legal que guían todas las etapas del proceso contractual estatal, buscando garantizar el interés público y el buen uso de los recursos. Son la base de la actuación de los servidores públicos y de la selección del contratista.</p><ul class=\"list-disc ml-5\"><li><strong>Principio de Transparencia:</strong> Impone la publicidad de los actos y procesos de contratación (pliegos de condiciones, avisos, informes de evaluación, etc.). Exige claridad en las reglas y criterios de selección. Busca garantizar la igualdad de oportunidades para todos los oferentes y evitar cualquier ventaja directa o indirecta que no provenga de la competencia. Prohíbe el uso de criterios subjetivos en la evaluación.</li><li><strong>Principio de Economía:</strong> Prioriza la eficiencia, eficacia y prontitud en la gestión contractual. Promueve la planeación adecuada de los procesos, la elaboración de estudios previos exhaustivos y la evaluación continua para optimizar los recursos. Busca obtener las mejores condiciones de calidad, precio y entrega para la entidad.</li><li><strong>Principio de Responsabilidad:</strong> Establece que tanto los servidores públicos que intervienen en el proceso contractual como los contratistas son responsables por sus acciones y omisiones que causen daño al Estado o a terceros. Busca la garantía del cumplimiento del contrato y la adecuada ejecución de los recursos.</li><li><strong>Principio de Selección Objetiva:</strong> Establece que la selección de la oferta más favorable debe basarse exclusivamente en factores objetivos que previamente se hayan establecido en el pliego de condiciones o la invitación pública. Prohíbe el uso de criterios subjetivos, discriminatorios o que busquen favorecer a un oferente específico. La mejor oferta es aquella que, sin exceder el presupuesto oficial, cumple con las condiciones técnicas y económicas más ventajosas para la entidad.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">III. Modalidades de Selección del Contratista</h4><p>La Ley 1150 de 2007, reglamentada por el Decreto 1082 de 2015, establece las siguientes modalidades de selección:</p><ul class=\"list-disc ml-5\"><li><strong>Licitación Pública (LP):</strong><ul class=\"list-circle ml-5 mt-1\"><li>Regla general de la contratación estatal.</li><li>Obligatoria para contratos cuya cuantía supere los umbrales establecidos anualmente por el Gobierno Nacional (determinados por el presupuesto de la entidad).</li><li>Implica una convocatoria pública amplia, competencia abierta, y una evaluación objetiva de las propuestas.</li><li>Se utiliza para la adquisición de bienes, obras y servicios que no califiquen para otras modalidades.</li></ul></li><li><strong>Selección Abreviada (SA):</strong><ul class=\"list-circle ml-5 mt-1\"><li>Es una modalidad más ágil y rápida que la licitación pública.</li><li>Se utiliza para contratos de menor cuantía (dentro de los umbrales específicos anuales).</li><li>Aplica para la adquisición de bienes y servicios de características técnicas uniformes y de común utilización (commodities), donde la estandarización y la oferta masiva permiten una selección más simple.</li><li>También se usa en casos de urgencia manifiesta, contratos interadministrativos (no aplicables si la causa es la menor cuantía), servicios de salud, y productos agropecuarios.</li></ul></li><li><strong>Concurso de Méritos (CM):</strong><ul class=\"list-circle ml-5 mt-1\"><li>Modalidad exclusiva para la contratación de consultorías, interventorías y proyectos donde el factor intelectual es predominante.</li><li>La selección se basa en la experiencia, formación académica y calidad del equipo del proponente, más allá del precio (aunque el precio puede ser un factor secundario de ponderación o desempate).</li><li>Se busca asegurar la idoneidad y la capacidad técnica e intelectual del contratista.</li></ul></li><li><strong>Contratación Directa (CD):</strong><ul class=\"list-circle ml-5 mt-1\"><li>Es una excepción a la regla general de la selección pública.</li><li>Aplica solo en casos taxativamente definidos por la ley, tales como: Urgencia Manifiesta, Empréstitos, Contratos Interadministrativos (siempre que la entidad que ejecuta tenga capacidad y objeto social para ello y no sea para evitar licitación por menor cuantía), Prestación de Servicios Profesionales y de Apoyo a la Gestión (personas naturales para actividades específicas que no pueden realizarse con personal de planta), Arrendamiento o Adquisición de Inmuebles, Bienes y servicios de entidades de carácter científico y tecnológico.</li></ul></li><li><strong>Mínima Cuantía:</strong> Aplicable para contratos de bajo valor, donde se permite un proceso simplificado de selección.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">IV. Aplicación en el Contexto de Ingeniería y Tecnología (IDU)</h4><p>Dado que tu cargo es para Profesional Especializado en el IDU, la aplicación de la normativa de contratación es de vital importancia, especialmente en su relación con la ingeniería, la tecnología y el desarrollo de software.</p><ul class=\"list-disc ml-5\"><li><strong>Adquisición de Bienes y Servicios Tecnológicos:</strong> Para bienes y servicios tecnológicos con características técnicas uniformes y de común utilización (commodities TI), la modalidad general es la Selección Abreviada (ejemplos: computadores de escritorio, licencias de software estándar, servicios de internet básico). Si los bienes o servicios tecnológicos no son uniformes o requieren un nivel de especialización considerable que no encaja en la SA, se debe acudir a la Licitación Pública.</li><li><strong>Consultorías de Ingeniería (y otras consultorías):</strong> La modalidad específica para la contratación de consultorías de ingeniería (ej. estudios de preinversión, diseño de proyectos, asesorías técnicas especializadas) es el Concurso de Méritos. Se valora la capacidad intelectual, la experiencia del consultor y de su equipo.</li><li><strong>Desarrollo de Software:</strong> La modalidad para la contratación de desarrollo de software es más matizada y depende de la predominancia del factor intelectual y creativo. Si implica una alta dosis de creatividad, diseño intelectual y consultoría especializada (ej. software innovador a medida), puede ser objeto de Concurso de Méritos. Si es para soluciones estándar, repetitivas, o de características ya definidas (ej. implementación de un ERP estándar), puede ser objeto de Licitación Pública o Selección Abreviada (si aplica por cuantía o uniformidad).</li><li><strong>Contratos Interadministrativos:</strong> Comunes en el sector público, incluyendo el IDU. Permiten la contratación directa entre entidades públicas, siempre que la entidad ejecutora tenga la capacidad y el objeto social para realizar la actividad. No pueden usarse para evadir otras modalidades.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">V. Colombia Compra Eficiente (CCE)</h4><p><strong>Colombia Compra Eficiente (CCE)</strong> es la Agencia Nacional de Contratación Pública. Su rol es fundamental en el sistema de contratación estatal:</p><ul class=\"list-disc ml-5\"><li><strong>Centralización de la información:</strong> Administra el SECOP, la plataforma transaccional donde se publican y gestionan los procesos de contratación.</li><li><strong>Expedición de guías y manuales:</strong> Genera documentos técnicos que orientan a las entidades y a los interesados en la aplicación de la normativa contractual.</li><li><strong>Modelos de documentos:</strong> Propone documentos tipo (pliegos, contratos) para facilitar la contratación.</li><li><strong>Formación y acompañamiento:</strong> Brinda capacitación y asesoría sobre el Estatuto General de Contratación de la Administración Pública.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">VI. Preguntas Tipo CNSC y Consejos para el Examen</h4><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">A. Juicio Situacional (Ejemplo)</h5><div class=\"bg-gray-100 p-4 rounded-lg border border-gray-300 mt-4\"><p class=\"font-bold mb-2\">Caso:</p><p>El IDU necesita contratar una consultoría para rediseñar su sistema de gestión urbana (valor: 2,000 SMMLV). El jefe de área sugiere contratar directamente a un experto conocido.</p><p class=\"font-bold mt-3 mb-2\">Pregunta:</p><p>¿Qué modalidad debe usarse según la Ley 80?</p><ul class=\"list-unstyled space-y-1 mt-2\"><li>a) Licitación Pública   <span class=\"text-green-600 font-bold\">(Correcta: supera el monto para selección abreviada y es una consultoría compleja, aunque el enunciado se enfoca en cuantía)</span></li><li>b) Contratación Directa  <span class=\"text-red-600\">(Incorrecta: no cumple excepciones del Art. 30)</span></li><li>c) Selección Abreviada  <span class=\"text-red-600\">(Incorrecta: límite es 1,500 SMMLV)</span></li></ul></div><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">B. Pregunta Directa (Ejemplo)</h5><p>¿Qué porcentaje mínimo debe asignarse a criterios técnicos en licitaciones de software según la Ley 1150?</p><p class=\"font-bold text-blue-700 mt-2\">Respuesta: 70% (Art. 5, Ley 1150).</p><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">C. Consejos para el Examen CNSC:</h5><ul class=\"list-disc ml-5\"><li><strong>Memorizar Montos:</strong> Conoce los umbrales de cuantía para Licitación Pública (>1,500 SMMLV), Selección Abreviada (menor cuantía, 500-1,500 SMMLV), y Contratación Directa (<500 SMMLV o casos específicos). Estos valores cambian anualmente, pero los umbrales relativos son importantes.</li><li><strong>Casos Prácticos:</strong> Relaciona los proyectos del IDU (ej: contratación de software urbano, construcción de vías, consultorías de diseño) con la modalidad de contratación que aplicarías.</li><li><strong>Evitar Errores Comunes:</strong> No confundir las excepciones de la Contratación Directa.</li><li><strong>Enfoque en Principios:</strong> Las respuestas correctas siempre se alinearán con la Transparencia, Economía, Responsabilidad y Selección Objetiva.</li></ul><div class=\"mt-8 p-4 bg-blue-50 rounded-lg border-l-4 border-blue-500 text-blue-800\"><p class=\"font-semibold mb-3\">¡Pon a prueba tu conocimiento de Contratación Pública Aplicada a Ingeniería!</p><button id=\"start-contratacion-quiz-btn\" class=\"bg-blue-600 text-white px-6 py-3 rounded-lg font-semibold hover:bg-blue-700 transition duration-300 transform hover:scale-105\">Realizar Simulacro de Contratación Pública</button></div>",
    "resources": [
        "Ley 80 de 1993 (Estatuto General de Contratación de la Administración Pública)",
        "Ley 1150 de 2007 (Modificaciones a la Ley 80)",
        "Decreto 1082 de 2015 (Decreto Único Reglamentario del Sector Administrativo de Planeación Nacional)",
        "Colombia Compra Eficiente (Manuales y Guías)",
        "Página web de Función Pública (para normativa actualizada)"
    ]
},
            
            
            
            
            
            
            
            
            {"id": "desarrollo-software", "title": "Desarrollo de Software", "content": "Conocimiento de los ciclos de vida del software (ej. Cascada, Espiral, Incremental, Iterativo) y de las metodologías de desarrollo. Particularmente, las metodologías ágiles como Scrum, Kanban o XP son ampliamente adoptadas en proyectos modernos de TI por su flexibilidad y enfoque en la entrega de valor incremental. Se espera la comprensión de buenas prácticas de codificación, pruebas (unitarias, integración, sistema, aceptación), y despliegue de aplicaciones.", "resources": ["Metodologías para el modelamiento, desarrollo y construcción de Sistemas de Información (manuales de referencia)", "Guías de Scrum y Kanban", "Principios SOLID y Clean Code"]},
            {"id": "diseno-bases-datos", "title": "Diseño y Gestión de Bases de Datos", "content": "Comprende el modelado de datos (diagramas Entidad-Relación, normalización de bases de datos para evitar redundancia y anomalías), los diferentes tipos de bases de datos (relacionales como PostgreSQL, MySQL; NoSQL como MongoDB, Cassandra), y el lenguaje SQL para consultas y manipulación de datos. La gestión incluye aspectos de rendimiento, seguridad y respaldo de la información.", "resources": ["Manuales de Bases de Datos (SQL, NoSQL)", "Principios de diseño de bases de datos relacionales y no relacionales"]},
            {"id": "formulacion-proyectos-informaticos", "title": "Formulación de Planes Programas y Proyectos Informáticos", "content": "Conocimiento del ciclo de vida de los proyectos (inicio, planificación, ejecución, seguimiento y control, cierre) aplicado a proyectos de Tecnologías de la Información. Familiaridad con los conceptos y áreas de conocimiento del PMBOK Guide (Guía de los Fundamentos para la Dirección de Proyectos) o metodologías similares. Esto incluye gestión del alcance, tiempo, costo, calidad, recursos, comunicaciones, riesgos, adquisiciones y partes interesadas en proyectos de software o infraestructura TI.", "resources": ["Gestión de Proyectos (PMBOK Guide, PRINCE2)", "Guías de formulación y evaluación de proyectos de TI"]},
            {"id": "seguridad-informacion", "title": "Seguridad de la Información", "content": "Comprensión de los principios fundamentales de la seguridad de la información: Confidencialidad (proteger la información del acceso no autorizado), Integridad (asegurar la exactitud y completitud de la información y sus métodos de procesamiento) y Disponibilidad (garantizar que los usuarios autorizados tengan acceso a la información y recursos cuando los necesiten). Conocimiento de la norma ISO 27001 (Sistemas de Gestión de la Seguridad de la Información) y la Ley 1581 de 2012 (Protección de Datos Personales o Habeas Data) en Colombia. Incluye la clasificación de la información y la gestión de incidentes.", "resources": ["Seguridad de la Información (normas ISO 27001)", "Ley 1581 de 2012", "Guías de ciberseguridad del Gobierno de Colombia"]},
            {"id": "seguridad-tecnologica", "title": "Seguridad Tecnológica", "content": "Aplicación de medidas y controles tecnológicos para proteger los sistemas de información y la infraestructura de TI. Incluye el conocimiento de amenazas comunes (malware, phishing, ataques de denegación de servicio - DDoS), vulnerabilidades, y soluciones (firewalls, sistemas de detección/prevención de intrusiones - IDS/IPS, cifrado, antivirus, gestión de identidades y accesos).", "resources": ["Guías de Ciberseguridad", "Normas técnicas para la seguridad de redes y sistemas"]},
            {"id": "sistemas-informacion", "title": "Sistemas de Información", "content": "Conceptos generales de sistemas de información, sus componentes (hardware, software, datos, personas, procesos) y su rol estratégico en las organizaciones. Tipos de sistemas (Sistemas de Información Gerencial - MIS, Sistemas de Planificación de Recursos Empresariales - ERP, Sistemas de Gestión de Relaciones con Clientes - CRM, Sistemas de Soporte a Decisiones - DSS), y su importancia en la gestión pública para la toma de decisiones y la optimización de procesos. Comprender la interoperabilidad entre sistemas y la gestión de datos.", "resources": ["Desarrollo de sistemas de información en los diferentes ambientes (libros y cursos)", "Casos de estudio de implementación de SI en el sector público"]}
        ]
    },
    {
        "id": "competencias-comportamentales",
        "title": "Competencias Comportamentales",
        "description": "Actitudes y comportamientos esperados en un servidor público, según lo establecido en el Decreto 815 de 2018 (que modifica el Decreto 1083 de 2015).",
        "subtopics": [
            {"id": "comportamental-adaptacion-cambio", "title": "Adaptación al Cambio", "content": "Capacidad para responder con flexibilidad y apertura a las nuevas situaciones, desafíos, tecnologías y políticas que surgen en el entorno laboral público. Implica la disposición para ajustar el propio comportamiento y enfoque ante transformaciones organizacionales.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Documentos sobre gestión del cambio organizacional"]},
            {"id": "comportamental-aporte-tecnico-profesional", "title": "Aporte Técnico-Profesional", "content": "Habilidad para aplicar conocimientos especializados y experiencia para generar valor, proponer soluciones innovadoras y resolver problemas complejos en las tareas asignadas. Se espera un alto nivel de experticia en tu área (TI) para el cargo de Profesional Especializado.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Estudios de caso sobre aplicación de conocimientos técnicos en el sector público"]},
            {"id": "comportamental-aprendizaje-continuo", "title": "Aprendizaje Continuo", "content": "Disposición permanente para adquirir nuevos conocimientos y habilidades, manteniéndose actualizado sobre tendencias, normativas y mejores prácticas en el campo de las tecnologías de la información y la gestión pública. Es fundamental en un entorno tecnológico en constante evolución.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Artículos sobre desarrollo profesional continuo en TI"]},
            {"id": "comportamental-compromiso-organizacion", "title": "Compromiso con la Organización", "content": "Identificación y alineación con la misión, visión, valores y objetivos estratégicos de la entidad (IDU) y del Distrito Capital. Implica una dedicación a las metas institucionales y un sentido de pertenencia.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Plan Estratégico del IDU", "Misión y Visión de la Alcaldía de Bogotá"]},
            {"id": "comportamental-comunicacion-efectiva", "title": "Comunicación Efectiva", "content": "Habilidad para transmitir ideas, información y argumentos de forma clara, concisa y persuasiva, tanto verbalmente como por escrito. También implica la capacidad de escuchar activamente a los demás y comprender diferentes perspectivas. Crucial para interactuar con equipos multidisciplinarios y usuarios.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Guías de comunicación asertiva"]},
            {"id": "comportamental-gestion-procedimientos", "title": "Gestión de Procedimientos", "content": "Capacidad para seguir, aplicar y optimizar los procesos, protocolos y normativas establecidas en la entidad para el cumplimiento de las funciones. Implica la adherencia a estándares de calidad y eficiencia en la ejecución de tareas.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Manuales de procesos y procedimientos del IDU"]},
            {"id": "comportamental-instrumentacion-decisiones", "title": "Instrumentación de Decisiones", "content": "Habilidad para tomar decisiones basadas en el análisis de información relevante, criterios sólidos y considerando las implicaciones a corto y largo plazo. Implica la capacidad de traducir un problema en una solución concreta y aplicable.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Marcos de toma de decisiones en gestión pública"]},
            {"id": "comportamental-orientacion-resultado", "title": "Orientación al Resultado", "content": "Enfoque constante en el cumplimiento de metas, la consecución de objetivos y la entrega de productos o servicios con calidad y eficiencia. Implica la capacidad de establecer prioridades y monitorear el progreso para asegurar el logro de los fines institucionales.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Marcos de gestión por resultados"]},
            {"id": "comportamental-orientacion-usuario-ciudadano", "title": "Orientación al Usuario y el Ciudadano", "content": "Disposición para atender, comprender y satisfacer las necesidades y expectativas de los usuarios y ciudadanos con calidad, eficiencia y amabilidad. Se centra en la prestación de un servicio público efectivo y con enfoque al ciudadano.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Guías de servicio al ciudadano en el sector público"]},
            {"id": "comportamental-trabajo-equipo", "title": "Trabajo en Equipo", "content": "Capacidad para colaborar, cooperar y contribuir activamente al logro de objetivos grupales y al mantenimiento de un ambiente de trabajo armonioso. Implica compartir conocimientos, apoyar a los compañeros y resolver conflictos de manera constructiva.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Estrategias para el trabajo colaborativo"]}
        ]
    }
]