[
    {
        "id": "integridad",
        "title": "Integridad (IDU)",
        "description": "Valores éticos institucionales definidos en la Cartilla de Integridad Gente IDU.",
        "subtopics": [
            {

"id": "integridad-compromiso",
    "title": "Compromiso",
    "content": "<p>El <strong>Compromiso</strong> en el Instituto de Desarrollo Urbano (IDU) trasciende la mera obligación laboral; es un valor ético central que guía la conducta de sus servidores públicos, transformando la integridad en acciones concretas y proactivas en el día a día. Se entiende como la base fundamental para la consecución de los objetivos del IDU en beneficio directo de la ciudadanía bogotana.</p><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">I. ¿Qué es el Compromiso en el Contexto del IDU?</h4><p>La <strong>Definición oficial</strong> según la Cartilla de Integridad Gente IDU (Versión 6.0, 2024):</p><blockquote class=\"bg-gray-100 border-l-4 border-blue-500 text-gray-700 p-3 italic my-4\">\"Somos conscientes de la importancia del rol del servidor público y estamos en disposición permanente para comprender y resolver las necesidades de las personas con las que nos relacionamos en las labores cotidianas, buscando siempre mejorar su bienestar.\"</blockquote><p>Esta definición subraya aspectos clave:</p><ul class=\"list-disc ml-5\"><li><strong>Conciencia del Rol:</strong> Reconocer la trascendencia de la labor pública y el impacto en la sociedad.</li><li><strong>Disposición Permanente:</strong> Una actitud proactiva y constante para actuar.</li><li><strong>Orientación a las Necesidades Humanas:</strong> Enfocarse en comprender y resolver las necesidades de las personas (ciudadanos y compañeros).</li><li><strong>Búsqueda del Bienestar:</strong> El fin último del compromiso es mejorar el bienestar de quienes interactúan con el IDU.</li></ul><p class=\"text-sm text-gray-600 mt-2\"><em>Definición inicial (Versión 03, 2015):</em> \"Dar lo mejor personal y profesionalmente para alcanzar los objetivos y metas de la entidad.\" Si bien esta definición es más concisa y orientada a los resultados internos, la versión 6.0 la complementa y amplía, poniendo un énfasis explícito en el ciudadano y el impacto social. Para la prueba, la versión 6.0 es la más relevante.</p><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">II. Fundamentos Normativos y su Alcance</h4><p>El Compromiso no es un valor aislado, sino que está profundamente anclado en el marco normativo y ético del servicio público colombiano y distrital.</p><ul class=\"list-disc ml-5\"><li><strong>Código de Integridad Gente IDU:</strong> Este documento lo incluye como uno de los siete valores institucionales centrales del IDU (Honestidad, Respeto, Justicia, Diligencia, Compromiso, Innovación y Trabajo en Red). La Cartilla (versión 6.0) reemplaza la antigua 'cartilla Acuerdo Ético Gente IDU' y articula los valores organizacionales del IDU con los del Código de Integridad del Servicio Público nacional.</li><li><strong>Código de Integridad: Valores del Servicio Público (Nacional):</strong> Lanzado a mediados de 2017 por el Gobierno Nacional (DAFP), este código identifica el compromiso como uno de los cinco valores esenciales (honestidad, respeto, justicia, diligencia y compromiso). Es un documento de tipo general para todos los servidores públicos del país.</li><li><strong>Resolución 744 de 2024 (IDU):</strong> Esta resolución interna del IDU promueve específicamente que los servidores públicos incrementen su compromiso mediante la aplicación de principios y valores éticos, reforzando la voluntad institucional de fomentar este valor.</li><li><strong>Articulación Normativa Superior:</strong> El Código de Integridad (y por ende el compromiso) se encuentra articulado con la Constitución Política, el Modelo Integrado de Planeación y Gestión (MIPG), el Código Disciplinario Único, el Estatuto Anticorrupción, y la Ley 2195 de 2022 (\"Por medio de la cual se adoptan medidas en materia de transparencia, prevención y lucha contra la corrupción\"). Esto significa que el compromiso es un principio rector para la legalidad, la disciplina y la lucha contra la corrupción en el servicio público.</li><li><strong>Enfoque Preventivo:</strong> La intención del Gobierno Nacional y del IDU es incentivar conductas positivas a favor de la legalidad, la vocación de servicio y el privilegio del bien general antes que el bien particular, consolidando un enfoque preventivo en torno a la integridad pública. El compromiso es la manifestación de esta priorización del interés público.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">III. Comportamientos Clave Asociados al Compromiso (Lo que Hacemos y No Hacemos)</h4><p>La prueba de Integridad se centra en la aplicación práctica. Es fundamental internalizar qué significa actuar con compromiso y qué acciones lo contradicen.</p><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">A. Comportamientos Deseables (Lo que hacemos):</h5><ul class=\"list-disc ml-5\"><li><strong>Responsabilidad y Asunción del Rol:</strong> Asumir nuestro papel como servidoras y servidores públicos, entendiendo el valor de los compromisos y responsabilidades que hemos asumido frente a la ciudadanía y el país.</li><li><strong>Calidad y Agilidad en el Servicio:</strong> Prestar nuestro servicio de manera ágil, amable y con calidad.</li><li><strong>Colaboración y Apoyo Institucional:</strong> Estar atentos y atentas a colaborar con el cumplimiento de las metas institucionales. Esto implica hacer que las cosas trasciendan el campo individual, trabajando como equipo y como Instituto.</li><li><strong>Orientación al Ciudadano y Escucha Activa:</strong> Escuchar, atender y orientar a quien lo necesite. Generar una gran experiencia de servicio a los ciudadanos.</li><li><strong>Proactividad y Mentalidad Positiva:</strong> Decir: \"¡Sí se puede!\", trabajando en búsqueda de una mejora continua para llegar a los resultados. Esto implica asumir responsabilidades adicionales.</li><li><strong>Pensamiento en el Bien Común:</strong> Generar un contexto pensando en el bien común (Relaciones Gana-Gana).</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">B. Comportamientos No Deseables (Lo que no hacemos):</h5><ul class=\"list-disc ml-5 text-red-700\"><li><strong>Incoherencia:</strong> Ser Incoherente entre lo que decimos y lo que hacemos. No somos ejemplo.</li><li><strong>Incumplimiento:</strong> Incumplir nuestra palabra.</li><li><strong>Evasión de Responsabilidad:</strong> Buscar justificaciones para no cumplir.</li><li><strong>Mal Hablar Institucional:</strong> Hablar mal del IDU, sus líderes y sus servidores y servidoras.</li><li><strong>Desinterés/Negligencia:</strong> Ignorar las inquietudes de la ciudadanía o compañeros. Actuar con desinterés o negligencia.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">IV. Relación del Compromiso con Otros Valores y Subsistemas del IDU</h4><p>El compromiso se interrelaciona y potencia con otros valores y subsistemas de gestión, formando el \"ADN IDU\":</p><ul class=\"list-disc ml-5\"><li><strong>Diligencia:</strong> El compromiso se vincula con cumplir las tareas con prontitud, destreza y eficiencia. Un servidor comprometido es diligente al cumplir sus obligaciones a cabalidad, usando responsablemente los recursos públicos y no postergando decisiones.</li><li><strong>Honestidad:</strong> Actuar con compromiso implica transparencia en todas las acciones. Un servidor honesto dirá la verdad, aceptará su responsabilidad y cuidará los recursos públicos, lo cual es una manifestación de compromiso.</li><li><strong>Respeto:</strong> El compromiso se refleja en un trato amable, igualitario y equitativo con todas las personas, sin discriminación. Implica estar abierto al diálogo y a la comprensión.</li><li><strong>Innovación:</strong> El compromiso impulsa la búsqueda de nuevas formas de enfrentar retos, incorporar tecnologías y mejorar procesos. Un servidor comprometido está abierto a aprender y desaprender continuamente, multiplicando nuevos conocimientos.</li><li><strong>Trabajo en Red:</strong> El compromiso se traduce en desarrollar el trabajo de manera conectada y articulada, tejiendo relaciones y compartiendo logros, ideas e inquietudes. Implica asumir el rol consciente y responsable como parte de un equipo.</li><li><strong>Subsistema de Gestión Antisoborno (SGAS):</strong> El SGAS prohíbe el soborno y se apalanca en la apropiación de los valores de integridad, incluido el compromiso, para la lucha contra la corrupción. Un servidor comprometido activamente contribuye a la prevención del soborno.</li><li><strong>Modelo y Subsistema de Gestión Empresa Familiarmente Responsable (efr):</strong> Este modelo se basa en la flexibilidad, el respeto y el compromiso mutuo (entidad - servidor/a) para conciliar la vida familiar, laboral y personal. El compromiso del servidor con la entidad se extiende a la corresponsabilidad por su bienestar.</li><li><strong>Programa CALDAS (Construcción de Ambientes Laborales Diversos, Amorosos y Seguros):</strong> CALDAS busca espacios libres de discriminación y respetuosos de la diferencia. El compromiso se alinea con CALDAS al fomentar un ambiente donde la diversidad es una oportunidad de crecimiento.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">V. Interiorización del Valor Compromiso y Preparación para la Prueba CNSC</h4><p>El compromiso no es solo una cualidad individual, sino una práctica que se integra en el día a día del servidor público del IDU. Para la prueba, no solo es saber la definición, sino cómo aplicarla en situaciones reales.</p><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">A. Estrategias de Interiorización y Estudio:</h5><ul class=\"list-disc ml-5\"><li><strong>Lectura Activa:</strong> Leer y resumir detalladamente la sección de \"Compromiso\" en las versiones 03 y 6.0 de la Cartilla/Código de Integridad Gente IDU. Identificar las diferencias y énfasis de cada versión.</li><li><strong>Análisis Conceptual:</strong> Reflexionar sobre la definición de compromiso: ¿Cómo se manifiesta la 'conciencia del rol público' en tu trabajo? ¿Cómo 'resuelves las necesidades de las personas' en tu labor diaria?</li><li><strong>Ejemplificación Personal:</strong> Piensa en 5 ejemplos reales (de tu entorno laboral/académico) donde hayas demostrado compromiso según las conductas deseables. Esto ayuda a personalizar el concepto y facilita la respuesta a preguntas situacionales.</li><li><strong>Comparación y Distinción:</strong> Comparar el compromiso con otros valores como honestidad (base de la verdad y justicia), diligencia (cumplimiento eficiente), y respeto (trato digno). Entender sus límites y puntos de intersección.</li><li><strong>Reflexión sobre Dilemas:</strong> ¿Cómo actuarías si un supervisor te encarga una tarea sensible sin acompañamiento y te sientes con dudas? ¿Priorizarías cumplir a medias o buscarías orientación y soluciones proactivas? Este tipo de reflexión es clave para las preguntas de juicio.</li><li><strong>Aplicación a Casos de TIC (Tu Rol):</strong> Relaciona el compromiso con ejemplos específicos de tu manual de funciones, como la 'ejecución del Plan Estratégico de Tecnologías de la Información y las Comunicaciones (PETIC)' o la 'Implementación de desarrollos de alta calidad de software'. Un compromiso en TI implicaría asegurar la ciberseguridad, cumplir cronogramas de desarrollo o garantizar la calidad del código, siempre pensando en el beneficio ciudadano.</li></ul><h5 class=\"text-lg font-semibold mt-3 mb-2 text-gray-800\">B. Consejos para la Prueba CNSC (Preguntas de Integridad):</h5><ul class=\"list-disc ml-5\"><li><strong>Enfoque en el Interés General:</strong> Las respuestas correctas siempre priorizarán el bien común, la legalidad y la ética por encima de los intereses personales o grupales. Siempre elige la opción que beneficie más a la ciudadanía y a la institución.</li><li><strong>Coherencia y Transparencia:</strong> La CNSC valora la consistencia entre el pensamiento, la palabra y la acción. Evita cualquier opción que implique ocultar información, mentir, buscar justificaciones para el incumplimiento o actuar de forma ambigua.</li><li><strong>Proactividad y Resolución de Problemas:</strong> El compromiso se manifiesta en la iniciativa para proponer mejoras, comunicar problemas a tiempo y buscar soluciones, no en la pasividad, la espera de órdenes o la queja.</li><li><strong>Responsabilidad y Asunción de Errores:</strong> Un servidor comprometido acepta las consecuencias de sus actos y busca el aprendizaje colectivo a partir de ellos, sin culpar a terceros.</li><li><strong>Colaboración y Trabajo en Equipo:</strong> El compromiso trasciende lo individual; se valora el trabajo colaborativo, la construcción de redes y la apropiación de procesos como responsabilidad compartida.</li><li><strong>Lenguaje Formal y Profesional:</strong> Al analizar las opciones, elige aquellas que demuestren un lenguaje y un comportamiento alineado con los valores institucionales y el rol del servidor público. Busca frases como \"garantizar el interés general\", \"cumplir metas con responsabilidad\", \"optimizar el uso de recursos públicos\".</li><li><strong>Evitar Contradicciones:</strong> Descartar opciones que demuestren desinterés, negligencia, evasión de funciones, malgasto de recursos públicos, actitudes negativas hacia la entidad o cualquier forma de conflicto de interés.</li></ul>",
    "resources": [
        "Guía de Orientación al Aspirante - Pruebas Escritas (Proceso de Selección Distrito Capital 6)",
        "Manual Específico de Funciones y Competencias Laborales (Empleo Profesional Especializado - IDU)",
        "Código de Integridad Gente IDU (Versión 03) [Si está disponible, para comparar]",
        "Cartilla de Integridad Gente IDU (Versión 6.0) [Foco principal de estudio]",
        "Resolución 744 de 2024 (IDU)",
        "Ley 2195 de 2022 (Transparencia, Prevención y Lucha contra la Corrupción)",
        "Código Único de Integridad del Servicio Público Colombiano (DAFP)"
    ]




            },
            {"id": "integridad-diligencia", "title": "Diligencia", "content": "Diligencia implica actuar con cuidado, atención y prontitud en las labores asignadas, buscando la eficiencia y el uso adecuado de los recursos. En el IDU, se traduce en la ejecución oportuna y efectiva de los proyectos de infraestructura.", "resources": ["Cartilla Integridad Gente IDU"]},
            {"id": "integridad-honestidad", "title": "Honestidad", "content": "Honestidad es actuar con rectitud, transparencia y veracidad en todas las actuaciones, evitando el conflicto de intereses y la corrupción. Fundamental en la gestión de recursos públicos y procesos de contratación del IDU.", "resources": ["Cartilla Integridad Gente IDU"]},
            {"id": "integridad-innovacion", "title": "Innovación", "content": "Innovación es la capacidad de buscar y aplicar nuevas ideas y soluciones para mejorar procesos y servicios, fomentando la creatividad en el trabajo. En un rol de TI en el IDU, esto es vital para proponer soluciones de software de vanguardia.", "resources": ["Cartilla Integridad Gente IDU"]},
            {"id": "integridad-justicia", "title": "Justicia", "content": "Justicia es actuar con equidad, imparcialidad y respeto por los derechos de todas las personas, garantizando un trato igualitario y sin discriminación. Aplica a la atención al ciudadano y la gestión de proyectos que impactan a la comunidad.", "resources": ["Cartilla Integridad Gente IDU"]},
            {"id": "integridad-respeto", "title": "Respeto", "content": "Respeto es reconocer y valorar la dignidad de las personas, las instituciones y el medio ambiente, promoviendo un ambiente de armonía y tolerancia. Crucial en las interacciones con colegas, superiores, ciudadanos y contratistas del IDU.", "resources": ["Cartilla Integridad Gente IDU"]},
            {"id": "integridad-trabajo-en-red", "title": "Trabajo en Red", "content": "Trabajo en Red implica colaborar y coordinar esfuerzos con otras áreas y entidades para alcanzar objetivos comunes, compartiendo conocimientos y recursos. Como profesional TI del IDU, colaborarás constantemente con otras Secretarías y entidades distritales.", "resources": ["Cartilla Integridad Gente IDU"]}
        ]
    },
    {
        "id": "funcionales-generales",
        "title": "Competencias Funcionales Generales",
        "description": "Conocimientos y habilidades aplicables a cualquier cargo en el Distrito Capital.",
        "subtopics": [
            {"id": "funcionamiento-distrito", "title": "Funcionamiento del Distrito Capital", "content": "Comprende la estructura administrativa, los procesos clave y la interacción entre las entidades y la ciudadanía.", "resources": ["Constitución Política Art. 209", "Página Alcaldía Mayor de Bogotá", "Decreto Ley 1421 de 1993 (Estatuto Orgánico de Bogotá)"]},
            {
                "id": "organizacion-distrito",
                "title": "Organización del Distrito Capital",
                "content": "<p>La estructura administrativa de Bogotá, Distrito Capital, se organiza para la eficiente gestión de los asuntos públicos y la prestación de servicios a sus ciudadanos. Comprender esta organización es fundamental para cualquier servidor público, y especialmente para tu rol en el Instituto de Desarrollo Urbano (IDU).</p><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">I. Sector Central: El Núcleo de la Administración</h4><p>Este sector agrupa los organismos que definen las políticas y directrices generales del Distrito. Incluye:</p><ul class=\"list-disc ml-5\"><li><strong>Despacho del Alcalde/Alcaldesa Mayor:</strong> Es la máxima autoridad administrativa y política. Sus funciones son amplias y abarcan desde la dirección de la acción administrativa y la garantía de cumplimiento de la Constitución y las leyes, hasta el nombramiento de funcionarios clave (secretarios, gerentes de entidades descentralizadas) y la presentación de proyectos de acuerdo al Concejo. <br><em>Ejemplo Práctico:</em> Una nueva iniciativa de 'Gobierno Abierto' sería liderada y coordinada directamente por la Alcaldía Mayor.</li><li><strong>Consejos Superiores de la Administración Distrital:</strong> Son cuerpos colegiados que asesoran y coordinan la gestión del Alcalde Mayor en áreas específicas (ej. Consejo de Gobierno Distrital).</li><li><strong>Secretarías de Despacho:</strong> Son los pilares sectoriales. Cada Secretaría formula, coordina y ejecuta políticas públicas en su área (Hacienda, Salud, Educación, Planeación, etc.) bajo la dirección del Alcalde. <br><em>Ejemplo Práctico:</em> La Secretaría Distrital de Planeación (SDP) sería tu principal interlocutor para alinear los proyectos de infraestructura del IDU con el Plan de Desarrollo Urbano.</li><li><strong>Departamentos Administrativos:</strong> Cumplen funciones administrativas de apoyo para el Sector Central (ej. Departamento Administrativo del Servicio Civil Distrital - DASCD, que apoya en gestión pública).</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">II. Sector Descentralizado: La Ejecución Especializada</h4><p>Este sector está conformado por entidades con personería jurídica, autonomía administrativa y financiera, y patrimonio propio. Su función principal es la ejecución especializada de políticas y proyectos. Se clasifican en adscritas (vinculadas a una Secretaría o al Alcalde) y vinculadas (generalmente empresas industriales y comerciales).</p><ul class=\"list-disc ml-5\"><li><strong>Institutos Descentralizados (¡Tu Casa: IDU!):</strong> Son entidades técnicas que ejecutan políticas y proyectos específicos. El <strong>Instituto de Desarrollo Urbano (IDU)</strong> es un ejemplo clave y de gran relevancia para tu cargo.<ul class=\"list-circle ml-5 mt-2\"><li><strong>Naturaleza y Propósito del IDU:</strong> Su misión principal es <strong>\"ARTICULAR, EJECUTAR E IMPLEMENTAR LOS PROYECTOS DE DESARROLLO O CONSTRUCCION DE SOFTWARE, ADOPTANDO LOS ESTANDARES Y BUENAS PRACTICAS DE ARQUITECTURAS Y POLITICAS DE TI DEFINIDAS POR EL AREA CON EL FIN DE CUMPLIR CON LOS REQUERIMIENTOS DE LOS USUARIOS\"</strong>. Esto es la esencia de tu futuro rol.</li><li><strong>Funciones Esenciales de tu Empleo (Profesional Especializado en el IDU):</strong> Tu trabajo se centrará en la automatización de procesos, desarrollo de aplicaciones de alta calidad, ejecución del Plan Estratégico de TI y Comunicaciones (PETIC), gestión de requerimientos (funcionales y no funcionales), implementación de proyectos de software alineados con la arquitectura de sistemas de información, aseguramiento de documentación y trazabilidad, aplicación de normatividad en desarrollo de aplicaciones, adaptación de lineamientos de Arquitectura Empresarial (MAE), elaboración de documentación para contratación de aplicativos, y atención a entes de control.</li><li><strong>Conocimientos Básicos o Esenciales:</strong> Necesitarás dominar Contratación Estatal, Modelo de Arquitectura Empresarial (MAE), Desarrollo de sistemas de información, Gestión de Proyectos, Metodologías para modelamiento y construcción de SI, y Procesos administrativos de tecnología.</li><li><strong>Estructura Organizacional del IDU:</strong> Es vital conocer cómo se organiza el IDU. Cuenta con un Consejo Directivo, una Dirección General y Subdirecciones Generales (como la de Desarrollo Urbano, Infraestructura, Jurídica y Gestión Corporativa). Tu vacante como Profesional Especializado se ubica específicamente dentro de la <strong>Subdirección Técnica de Recursos Tecnológicos</strong>, que a su vez pertenece a la Subdirección General de Gestión Corporativa. Entender este organigrama te permitirá saber con quién interactuarás y dónde encaja tu rol. <br><em>Ejemplo Práctico:</em> Si necesitas información sobre una nueva regulación de contratación, tu consulta iría a la Subdirección Jurídica del IDU, no directamente a una Secretaría Distrital.</li></ul></li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">III. Sector de las Localidades: La Gestión Local</h4><p>Este sector se encarga de la administración de los asuntos a nivel local. Comprende las Alcaldías Locales y los Fondos de Desarrollo Local, que ejecutan proyectos directamente en las veinte localidades de Bogotá.</p><ul class=\"list-disc ml-5\"><li><em>Ejemplo Práctico:</em> Un proyecto de mejoramiento de una vía local que afecte a una sola localidad sería gestionado y financiado en coordinación con la Alcaldía Local correspondiente.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">IV. Órganos de Control del Distrito: Garantizando Transparencia y Legalidad</h4><p>Aunque no forman parte de la administración directa, estos órganos son cruciales para la supervisión y la transparencia del Distrito Capital.</p><ul class=\"list-disc ml-5\"><li><strong>Concejo de Bogotá D.C.:</strong> Es la suprema autoridad normativa del Distrito. Expide <strong>Acuerdos</strong> (equivalentes a leyes a nivel distrital) sobre el Plan de Desarrollo, la estructura administrativa, urbanismo, y el endeudamiento. Vigila y controla la gestión de las autoridades distritales. Es quien aprueba tu cargo y las funciones generales de tu entidad. <br><em>Importante:</em> Los 'Acuerdos de la Alcaldía Mayor' mencionados en algunas guías se refieren a los Acuerdos del Concejo que rigen la administración distrital. El Alcalde y las Secretarías expiden Decretos y Resoluciones.</li><li><strong>Contraloría de Bogotá D.C.:</strong> Órgano de control fiscal. Vigila la gestión de los recursos del Distrito, auditando la eficiencia y efectividad del gasto público. <br><em>Ejemplo Práctico:</em> Tu área en el IDU podría ser auditada por la Contraloría para verificar la correcta ejecución presupuestal de un proyecto de software.</li><li><strong>Personería de Bogotá D.C.:</strong> Ejerce funciones de Ministerio Público y defensor de los derechos humanos. Vigila la conducta de los servidores públicos y protege los derechos fundamentales de los ciudadanos. <br><em>Ejemplo Práctico:</em> Si un ciudadano tiene una queja sobre la atención recibida en el IDU o sobre una afectación de sus derechos, podría acudir a la Personería.</li></ul><h4 class=\"text-xl font-semibold mt-4 mb-2 text-blue-700\">Relación e Interacción: La Dinámica del Distrito</h4><p>Es vital comprender cómo todos estos componentes interactúan para el funcionamiento armónico del Distrito:</p><ul class=\"list-disc ml-5\"><li>El <strong>Alcalde Mayor</strong> lidera la administración central, ejecutando las políticas y programas.</li><li>El <strong>Concejo de Bogotá</strong> provee el marco normativo a través de sus Acuerdos, que definen cómo se estructura y opera la administración.</li><li>Las <strong>Secretarías</strong> formulan políticas sectoriales (ej. Secretaría de Planeación para desarrollo urbano, Secretaría de Hacienda para presupuesto).</li><li>Los <strong>Institutos Descentralizados (como el IDU)</strong> ejecutan proyectos y programas específicos bajo la dirección de las Secretarías sectoriales o la Alcaldía Mayor. Por ejemplo, el IDU ejecuta los planes de infraestructura que la Secretaría de Planeación define y el Concejo aprueba.</li><li>Los <strong>Órganos de Control</strong> supervisan a toda la administración para garantizar la legalidad, transparencia y el respeto por los derechos de los ciudadanos.</li></ul><p><em>Ejemplo de Pregunta (PJS) Orientada a tu rol:</em></p><div class=\"bg-gray-100 p-4 rounded-lg border border-gray-300 mt-4\"><p class=\"font-bold mb-2\">Caso:</p><p>Una nueva política de infraestructura tecnológica distrital ha sido aprobada mediante Acuerdo por el Concejo de Bogotá. Como Profesional Especializado del IDU, se te encarga la implementación de un componente específico de desarrollo de software para esta política, que requiere la alineación con los planes estratégicos de otras entidades distritales y la gestión eficiente de recursos presupuestales.</p><p class=\"font-bold mt-3 mb-2\">Enunciado:</p><p>¿Cuál de las siguientes acciones refleja una comprensión adecuada de la cadena de mando y coordinación en el Distrito Capital para la ejecución de esta política, considerando tu rol en el IDU?</p><ul class=\"list-unstyled space-y-1 mt-2\"><li>A) Iniciar directamente el desarrollo del software, asumiendo que el Acuerdo del Concejo ya proporciona todas las directrices técnicas y presupuestales específicas.</li><li>B) Coordinar con la Secretaría Distrital de Planeación para asegurar la alineación del componente de software con el Plan de Desarrollo Distrital, y con la Secretaría de Hacienda para validar la disponibilidad y asignación presupuestal específica para el proyecto en el IDU.</li><li>C) Presentar un informe preliminar de avance a la Contraloría de Bogotá para que realice una auditoría preventiva sobre la etapa inicial del proyecto y su asignación de recursos.</li></ul><p class=\"font-bold mt-3 mb-2\">Respuesta Correcta: B)</p><p class=\"text-sm\"><strong>Explicación:</strong> La opción B demuestra una comprensión clara de la interacción interinstitucional. Una política aprobada por el Concejo requiere la coordinación con la Secretaría de Planeación (para alineación estratégica) y Hacienda (para presupuesto) antes de la ejecución por una entidad descentralizada como el IDU. La opción A ignora la necesidad de coordinación y planificación detallada. La opción C es prematura; la Contraloría realiza control fiscal posterior o preventivo, pero no inicia auditorías sobre etapas tempranas de un proyecto sin un proceso establecido o indicio de irregularidad.</p></div>",
                "resources": [
                    "Decreto Ley 1421 de 1993 (Estatuto Orgánico de Bogotá D.C.)",
                    "Página web del Concejo de Bogotá D.C. (para Acuerdos)",
                    "Página web de la Contraloría de Bogotá D.C.",
                    "Página web de la Personería de Bogotá D.C.",
                    "Organigrama del IDU y Manual de Funciones de tu cargo (OPEC 210171)"
                ]
            },
            {"id": "razonamiento-analitico", "title": "Razonamiento Analítico", "content": "Capacidad para interpretar, analizar y resolver problemas lógicos y abstractos. En las pruebas de la CNSC, esto se evalúa a través de comprensión de lectura, inferencia lógica, resolución de problemas matemáticos básicos y análisis de gráficos o tablas. Es una habilidad transversal crucial para el éxito en cualquier empleo público.", "resources": ["Ejercicios de lógica", "Guías de razonamiento verbal y cuantitativo", "Simulacros de la CNSC de razonamiento abstracto"]}
        ]
    },
    {
        "id": "funcionales-especificas",
        "title": "Competencias Funcionales Específicas",
        "description": "Conocimientos técnicos relacionados directamente con tu rol como Profesional Especializado.",
        "subtopics": [
            {"id": "arquitectura-empresarial", "title": "Arquitectura Empresarial", "content": "Conceptos, principios y aplicación del Modelo de Arquitectura Empresarial (MAE) del Ministerio de Tecnologías de la Información y las Comunicaciones (MinTIC). El MAE busca alinear la tecnología con los objetivos estratégicos de la entidad, optimizando procesos y la entrega de valor público.", "resources": ["Marco de Referencia de Arquitectura Empresarial MinTIC", "Guías de implementación del MAE en el sector público colombiano"]},
            {"id": "contratacion-publica", "title": "Contratación Pública Aplicada Ingeniería", "content": "Dominio de la Ley 80 de 1993 (Estatuto General de Contratación de la Administración Pública), Ley 1150 de 2007 (Modificaciones a la Ley 80), y el Decreto 1082 de 2015 (Reglamentario). Especial énfasis en las modalidades de selección (licitación pública, selección abreviada, concurso de méritos, contratación directa) aplicables a la adquisición de bienes y servicios tecnológicos, consultorías de ingeniería y desarrollo de software. Debes comprender los principios de transparencia, economía, responsabilidad y selección objetiva.", "resources": ["Ley 80 de 1993", "Ley 1150 de 2007", "Decreto 1082 de 2015", "Colombia Compra Eficiente (manuales y guías)"]},
            {"id": "desarrollo-software", "title": "Desarrollo de Software", "content": "Conocimiento de los ciclos de vida del software (ej. Cascada, Espiral, Incremental, Iterativo) y de las metodologías de desarrollo. Particularmente, las metodologías ágiles como Scrum, Kanban o XP son ampliamente adoptadas en proyectos modernos de TI por su flexibilidad y enfoque en la entrega de valor incremental. Se espera la comprensión de buenas prácticas de codificación, pruebas (unitarias, integración, sistema, aceptación), y despliegue de aplicaciones.", "resources": ["Metodologías para el modelamiento, desarrollo y construcción de Sistemas de Información (manuales de referencia)", "Guías de Scrum y Kanban", "Principios SOLID y Clean Code"]},
            {"id": "diseno-bases-datos", "title": "Diseño y Gestión de Bases de Datos", "content": "Comprende el modelado de datos (diagramas Entidad-Relación, normalización de bases de datos para evitar redundancia y anomalías), los diferentes tipos de bases de datos (relacionales como PostgreSQL, MySQL; NoSQL como MongoDB, Cassandra), y el lenguaje SQL para consultas y manipulación de datos. La gestión incluye aspectos de rendimiento, seguridad y respaldo de la información.", "resources": ["Manuales de Bases de Datos (SQL, NoSQL)", "Principios de diseño de bases de datos relacionales y no relacionales"]},
            {"id": "formulacion-proyectos-informaticos", "title": "Formulación de Planes Programas y Proyectos Informáticos", "content": "Conocimiento del ciclo de vida de los proyectos (inicio, planificación, ejecución, seguimiento y control, cierre) aplicado a proyectos de Tecnologías de la Información. Familiaridad con los conceptos y áreas de conocimiento del PMBOK Guide (Guía de los Fundamentos para la Dirección de Proyectos) o metodologías similares. Esto incluye gestión del alcance, tiempo, costo, calidad, recursos, comunicaciones, riesgos, adquisiciones y partes interesadas en proyectos de software o infraestructura TI.", "resources": ["Gestión de Proyectos (PMBOK Guide, PRINCE2)", "Guías de formulación y evaluación de proyectos de TI"]},
            {"id": "seguridad-informacion", "title": "Seguridad de la Información", "content": "Comprensión de los principios fundamentales de la seguridad de la información: Confidencialidad (proteger la información del acceso no autorizado), Integridad (asegurar la exactitud y completitud de la información y sus métodos de procesamiento) y Disponibilidad (garantizar que los usuarios autorizados tengan acceso a la información y recursos cuando los necesiten). Conocimiento de la norma ISO 27001 (Sistemas de Gestión de la Seguridad de la Información) y la Ley 1581 de 2012 (Protección de Datos Personales o Habeas Data) en Colombia. Incluye la clasificación de la información y la gestión de incidentes.", "resources": ["Seguridad de la Información (normas ISO 27001)", "Ley 1581 de 2012", "Guías de ciberseguridad del Gobierno de Colombia"]},
            {"id": "seguridad-tecnologica", "title": "Seguridad Tecnológica", "content": "Aplicación de medidas y controles tecnológicos para proteger los sistemas de información y la infraestructura de TI. Incluye el conocimiento de amenazas comunes (malware, phishing, ataques de denegación de servicio - DDoS), vulnerabilidades, y soluciones (firewalls, sistemas de detección/prevención de intrusiones - IDS/IPS, cifrado, antivirus, gestión de identidades y accesos).", "resources": ["Guías de Ciberseguridad", "Normas técnicas para la seguridad de redes y sistemas"]},
            {"id": "sistemas-informacion", "title": "Sistemas de Información", "content": "Conceptos generales de sistemas de información, sus componentes (hardware, software, datos, personas, procesos) y su rol estratégico en las organizaciones. Tipos de sistemas (Sistemas de Información Gerencial - MIS, Sistemas de Planificación de Recursos Empresariales - ERP, Sistemas de Gestión de Relaciones con Clientes - CRM, Sistemas de Soporte a Decisiones - DSS), y su importancia en la gestión pública para la toma de decisiones y la optimización de procesos. Comprender la interoperabilidad entre sistemas y la gestión de datos.", "resources": ["Desarrollo de sistemas de información en los diferentes ambientes (libros y cursos)", "Casos de estudio de implementación de SI en el sector público"]}
        ]
    },
    {
        "id": "competencias-comportamentales",
        "title": "Competencias Comportamentales",
        "description": "Actitudes y comportamientos esperados en un servidor público, según lo establecido en el Decreto 815 de 2018 (que modifica el Decreto 1083 de 2015).",
        "subtopics": [
            {"id": "comportamental-adaptacion-cambio", "title": "Adaptación al Cambio", "content": "Capacidad para responder con flexibilidad y apertura a las nuevas situaciones, desafíos, tecnologías y políticas que surgen en el entorno laboral público. Implica la disposición para ajustar el propio comportamiento y enfoque ante transformaciones organizacionales.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Documentos sobre gestión del cambio organizacional"]},
            {"id": "comportamental-aporte-tecnico-profesional", "title": "Aporte Técnico-Profesional", "content": "Habilidad para aplicar conocimientos especializados y experiencia para generar valor, proponer soluciones innovadoras y resolver problemas complejos en las tareas asignadas. Se espera un alto nivel de experticia en tu área (TI) para el cargo de Profesional Especializado.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Estudios de caso sobre aplicación de conocimientos técnicos en el sector público"]},
            {"id": "comportamental-aprendizaje-continuo", "title": "Aprendizaje Continuo", "content": "Disposición permanente para adquirir nuevos conocimientos y habilidades, manteniéndose actualizado sobre tendencias, normativas y mejores prácticas en el campo de las tecnologías de la información y la gestión pública. Es fundamental en un entorno tecnológico en constante evolución.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Artículos sobre desarrollo profesional continuo en TI"]},
            {"id": "comportamental-compromiso-organizacion", "title": "Compromiso con la Organización", "content": "Identificación y alineación con la misión, visión, valores y objetivos estratégicos de la entidad (IDU) y del Distrito Capital. Implica una dedicación a las metas institucionales y un sentido de pertenencia.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Plan Estratégico del IDU", "Misión y Visión de la Alcaldía de Bogotá"]},
            {"id": "comportamental-comunicacion-efectiva", "title": "Comunicación Efectiva", "content": "Habilidad para transmitir ideas, información y argumentos de forma clara, concisa y persuasiva, tanto verbalmente como por escrito. También implica la capacidad de escuchar activamente a los demás y comprender diferentes perspectivas. Crucial para interactuar con equipos multidisciplinarios y usuarios.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Guías de comunicación asertiva"]},
            {"id": "comportamental-gestion-procedimientos", "title": "Gestión de Procedimientos", "content": "Capacidad para seguir, aplicar y optimizar los procesos, protocolos y normativas establecidas en la entidad para el cumplimiento de las funciones. Implica la adherencia a estándares de calidad y eficiencia en la ejecución de tareas.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Manuales de procesos y procedimientos del IDU"]},
            {"id": "comportamental-instrumentacion-decisiones", "title": "Instrumentación de Decisiones", "content": "Habilidad para tomar decisiones basadas en el análisis de información relevante, criterios sólidos y considerando las implicaciones a corto y largo plazo. Implica la capacidad de traducir un problema en una solución concreta y aplicable.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Marcos de toma de decisiones en gestión pública"]},
            {"id": "comportamental-orientacion-resultado", "title": "Orientación al Resultado", "content": "Enfoque constante en el cumplimiento de metas, la consecución de objetivos y la entrega de productos o servicios con calidad y eficiencia. Implica la capacidad de establecer prioridades y monitorear el progreso para asegurar el logro de los fines institucionales.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Marcos de gestión por resultados"]},
            {"id": "comportamental-orientacion-usuario-ciudadano", "title": "Orientación al Usuario y el Ciudadano", "content": "Disposición para atender, comprender y satisfacer las necesidades y expectativas de los usuarios y ciudadanos con calidad, eficiencia y amabilidad. Se centra en la prestación de un servicio público efectivo y con enfoque al ciudadano.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Guías de servicio al ciudadano en el sector público"]},
            {"id": "comportamental-trabajo-equipo", "title": "Trabajo en Equipo", "content": "Capacidad para colaborar, cooperar y contribuir activamente al logro de objetivos grupales y al mantenimiento de un ambiente de trabajo armonioso. Implica compartir conocimientos, apoyar a los compañeros y resolver conflictos de manera constructiva.", "resources": ["Decreto 815 de 2018", "Decreto 1083 de 2015", "Estrategias para el trabajo colaborativo"]}
        ]
    }
]